Repository: louisje/maxurl
Catalog: po/*.po
Languages: pt_br

source: Clicking the popup image closes the popup
pt_br: Fecha o pop-up ao clicar na imagem

source: Clicking video closes
pt_br: Fecha o vídeo ao clicar

source: Clicking the popup video closes the popup
pt_br: Fecha o pop-up ao clicar no vídeo

source: Clicking link downloads
pt_br: Clicar no link faz o download

source: Instead of opening the link in a new tab, it will download the image/video instead
pt_br: Em vez de abrir o link em uma nova guia, ele fará o download da imagem/vídeo

source: Close key
pt_br: Tecla para fechar

source: Closes the popup when this key is pressed. Currently, ESC will also close the popup regardless of the value of this setting.
pt_br: Fecha o pop-up quando esta tecla é pressionada. Atualmente, ESC também fecha o pop-up independentemente do valor desta configuração.

source: Download key
pt_br: Tecla para download

source: Downloads the image in the popup when this key is pressed
pt_br: Baixa a imagem no pop-up quando esta tecla é pressionada

source: Open in new tab key
pt_br: Tecla para abrir em uma nova guia

source: Opens the image in the popup in a new tab when this key is pressed
pt_br: Abre a imagem no pop-up em uma nova guia quando esta tecla é pressionada

source: Open in background tab key
pt_br: Tecla para abrir em segundo plano

source: Opens the image in the popup in a new tab without switching to it when this key is pressed
pt_br: Abre a imagem no pop-up em uma nova guia sem alternar para ela quando esta tecla é pressionada

source: Copy link key
pt_br: Tecla para copiar link

source: Copies the link of the media to the clipboard when this key is pressed
pt_br: Copia o link da mídia para a área de transferência quando esta tecla é pressionada

source: Open options key
pt_br: Tecla para abrir as opções

source: Opens this page in a new tab when this key is pressed
pt_br: Abre esta página em uma nova guia quando esta tecla é pressionada

source: Open original page key
pt_br: Tecla para abrir a página original

source: Opens the original page (if available) when this key is pressed
pt_br: Abre a página original (se disponível) quando esta tecla é pressionada

source: Rotate left key
pt_br: Tecla para girar para a esquerda

source: Rotates the popup 90 degrees to the left
pt_br: Gira o pop-up 90 graus para a esquerda

source: Rotate right key
pt_br: Tecla para girar para a direita

source: Rotates the popup 90 degrees to the right
pt_br: Gira o pop-up 90 graus para a direita

source: Horizontal flip key
pt_br: Tecla para inverter horizontalmente

source: Flips the image horizontally
pt_br: Inverte a imagem horizontalmente

source: Vertical flip key
pt_br: Tecla para inverter verticalmente

source: Flips the image vertically
pt_br: Inverte a imagem verticalmente

source: Zoom in key
pt_br: Tecla para ampliar

source: Incrementally zooms into the image
pt_br: Amplia a imagem incrementalmente

source: Zoom out key
pt_br: Tecla para reduzir

source: Incrementally zooms out of the image
pt_br: Reduz a imagem incrementalmente

source: Full zoom key
pt_br: Tecla para zoom total

source: Sets the image to be at a 100% zoom, even if it overflows the screen
pt_br: Define a imagem para ter um zoom de 100%, mesmo que transborde a tela

source: Fit screen key
pt_br: Tecla para ajustar à tela

source: Sets the image to either be at a 100% zoom, or to fit the screen, whichever is smaller
pt_br: Define a imagem para ter um zoom de 100% ou para caber na tela, o que for menor

source: Toggle fullscreen key
pt_br: Tecla para alternar tela cheia

source: Toggles fullscreen mode for the image/video in the popup
pt_br: Alterna o modo de tela cheia para a imagem/vídeo no popup

source: Popup for plain hyperlinks
pt_br: Popup para hyperlinks simples

source: Whether or not the popup should also open for plain hyperlinks
pt_br: Se o popup também deve abrir para hyperlinks simples

source: Only for links that look valid
pt_br: Somente para links que parecem válidos

source: Enabling this option will only allow links to be popped up if they look valid (such as if they have a known image/video extension, or are explicitly supported)
pt_br: Ativar esta opção permitirá que os links sejam exibidos em popup apenas se parecerem válidos (como se tiverem uma extensão de imagem/vídeo conhecida ou forem explicitamente suportados)

source: Popup page URL
pt_br: URL da página do popup

source: If no element can be found, try the page URL. Only relevant for pagelink rules, such as image and video hosting websites
pt_br: Se nenhum elemento for encontrado, tente a URL da página. Relevante apenas para regras de pagelink, como sites de hospedagem de imagem e vídeo

source: Popup for `<iframe>`
pt_br: Popup para `<iframe>`

source: Allows `<iframe>` elements to be popped up as well. Storing images/videos in this way is rather uncommon, but it can allow embeds to be supported
pt_br: Permite que elementos `<iframe>` também sejam abertos em popup. Armazenar imagens/vídeos desta forma é incomum, mas pode permitir suporte a embeds

source: Popup for `<canvas>`
pt_br: Popup para `<canvas>`

source: Allows `<canvas>` elements to be popped up as well. This will likely cause popups with any kind of web-based games, so it's recommended to keep this disabled
pt_br: Permite que elementos `<canvas>` também sejam abertos em popup. Isso provavelmente causará popups com qualquer tipo de jogo baseado na web, portanto, é recomendável manter esta opção desativada

source: Popup for `<svg>`
pt_br: Popup para `<svg>`

source: Allows `<svg>` elements to be popped up as well. These are usually used for icons, and can occasionally cause problems for websites that overlay icons on top of images
pt_br: Permite que elementos `<svg>` também sejam abertos em popup. Geralmente são usados para ícones e ocasionalmente podem causar problemas para sites que sobrepõem ícones em cima de imagens

source: Enable gallery
pt_br: Ativar galeria

source: Toggles whether gallery detection support should be enabled
pt_br: Alterna se o suporte à detecção de galeria deve ser ativado

source: Cycle gallery
pt_br: Ciclo da galeria

source: Going to the previous image for the first image will lead to the last image and vice-versa
pt_br: Ir para a imagem anterior na primeira imagem levará para a última imagem e vice-versa

source: Previous gallery item
pt_br: Item anterior da galeria

source: Key to trigger the previous gallery item
pt_br: Tecla para acionar o item anterior da galeria

source: Next gallery item
pt_br: Próximo item da galeria

source: Key to trigger the next gallery item
pt_br: Tecla para acionar o próximo item da galeria

source: Gallery download key
pt_br: Tecla para baixar a galeria

source: Key to download the current gallery
pt_br: Tecla para baixar a galeria atual

source: Download method
pt_br: Método de download

source: How the gallery should be downloaded
pt_br: Como a galeria deve ser baixada

source: Zip file
pt_br: Arquivo Zip

source: Download unchanged media
pt_br: Baixar mídia inalterada

source: Includes gallery items that have not been changed. Useful to potentially avoid downloading thumbnails
pt_br: Inclui itens da galeria que não foram alterados. Útil para evitar o download de miniaturas

source: Directory/zip filename format
pt_br: Formato do nome do diretório/arquivo zip

source: Format string(s) for the directory (package name for JDownloader) and zip filename (if applicable). Refer to "Filename format" under the Rules section for documentation. The variables are set from the first loaded media. An additional `items_amt` format variable is supported, which contains the number of items. `.zip` will be automatically suffixed for zip filenames.
pt_br: Cadeia(s) de formato para o diretório (nome do pacote para JDownloader) e nome do arquivo zip (se aplicável). Consulte "Formato do nome do arquivo" na seção Regras para obter documentação. As variáveis são definidas a partir da primeira mídia carregada. Uma variável de formato adicional items_amt é suportada, que contém o número de itens. .zip será automaticamente adicionado como sufixo para nomes de arquivos zip.

source: Zip: Store in subdirectory
pt_br: Zip: Armazenar em subdiretório

source: Stores the files in a subdirectory with the same name as the .zip file (without the .zip extension)
pt_br: Armazena os arquivos em um subdiretório com o mesmo nome do arquivo .zip (sem a extensão .zip)

source: JD: Autostart
pt_br: JD: Iniciar automaticamente

source: Autostarts the download when added to JDownloader
pt_br: Inicia o download automaticamente quando adicionado ao JDownloader

source: JD: Referer policy
pt_br: JD: Política de Referência

source: Due to a current limitation in JDownloader's API, the `Referer` (sic) header can only be set on a per-package basis. This option allows working around it by submitting multiple packages with the same name using different Referer headers. This can result in JD spamming notifications due to the number of packages created.
pt_br: Devido a uma limitação atual na API do JDownloader, o cabeçalho `Referer` (sic) só pode ser definido por pacote. Esta opção permite contornar isso enviando vários pacotes com o mesmo nome usando diferentes cabeçalhos Referer. Isso pode resultar em spam de notificações do JD devido ao número de pacotes criados.

source: Per-domain
pt_br: Por domínio

source: Zip: Store info file
pt_br: Zip: Armazenar arquivo de informações

source: Stores a `info.txt` file in the .zip containing information about the downloaded files and host page.
pt_br: Armazena um arquivo `info.txt` no .zip contendo informações sobre os arquivos baixados e a página de origem.

source: Move to next when video finishes
pt_br: Mover para o próximo quando o vídeo terminar

source: Moves to the next gallery item when a video finishes playing
pt_br: Move para o próximo item da galeria quando um vídeo terminar de reproduzir

source: Popup CSS style
pt_br: Estilo CSS do popup

source: Custom CSS styles for the popup
pt_br: Estilos CSS personalizados para o popup

source: Most valid CSS is supported, with these differences: <ul><li>Multiline comments (<code>/* ... */</code>) are currently not supported</li> <li>Single comments (<code>// ...</code>) are supported, but only at the beginning of a line</li> <li><code>%thumburl%</code> is the URL of the thumbnail image. For example, you could use it like this: <code>background-image: url(%thumburl%)</code><br /> The URL is properly encoded, so quotes are not necessary (but not harmful either)</li> <li><code>%fullurl%</code> is the URL of the full image. If IMU fails to find a larger image, it will be the same as <code>%thumburl%</code></li> <li>Styles are <code>!important</code> by default</li></ul> <p>For Button CSS style, you can also customize the CSS for individual buttons through their IDs. For example:</p> <pre> #closebtn { background-color: red; // -imu-text allows you to set the text inside the button -imu-text: "Close"; // -imu-title allows you to set the tooltip when hovering -imu-title: "Close the popup"; } #galleryprevbtn, #gallerynextbtn { border-radius: 100px; } </pre>
pt_br: A maior parte do CSS válido é suportada, com as seguintes diferenças: <ul><li>Comentários multilinha (<code>/ ... */</code>) não são suportados no momento</li> <li>Comentários de linha única (<code>// ...</code>) são suportados, mas apenas no início de uma linha</li> <li><code>%thumburl%</code> é a URL da imagem em miniatura. Por exemplo, você pode usá-la assim: <code>background-image: url(%thumburl%)</code><br /> A URL é codificada corretamente, então aspas não são necessárias (mas também não são prejudiciais)</li> <li><code>%fullurl%</code> é a URL da imagem completa. Se o IMU não conseguir encontrar uma imagem maior, ela será a mesma que <code>%thumburl%</code></li> <li>Os estilos são <code>!important</code> por padrão</li></ul> <p>Para o estilo CSS dos botões, você também pode personalizar o CSS para botões individuais através de seus IDs. Por exemplo:</p> <pre> #closebtn { background-color: red; // -imu-text permite definir o texto dentro do botão -imu-text: "Fechar"; // -imu-title permite definir a dica de ferramenta ao passar o mouse -imu-title: "Fechar popup"; } #galleryprevbtn, #gallerynextbtn { border-radius: 100px; } </pre>

source: Enable popup fade
pt_br: Habilitar efeito de fade no popup

source: Enables a fade in/out effect when the popup is opened/closed
pt_br: Habilita um efeito de fade in/out quando o popup é aberto/fechado

source: Enable zoom effect
pt_br: Habilitar efeito de zoom

source: Toggles whether the popup should 'zoom' when opened/closed
pt_br: Alterna se o popup deve aplicar 'zoom' ao abrir/fechar

source: Move from thumbnail when zooming
pt_br: Mover da miniatura ao aplicar zoom

source: Moves the popup from the thumbnail to the final location while zooming. The animation can be a little rough
pt_br: Move o popup da miniatura para o local final enquanto aplica o zoom. A animação pode ser um pouco brusca

source: Popup animation time
pt_br: Tempo de animação do popup

source: Fade/zoom animation duration (in milliseconds) for the popup
pt_br: Duração da animação de fade/zoom (em milissegundos) para o popup

source: Enable background CSS
pt_br: Habilitar CSS de fundo

source: Toggles whether CSS styles for the background when the popup is active is enabled
pt_br: Alterna se os estilos CSS para o fundo quando o popup está ativo estão habilitados

source: On hold
pt_br: Em espera

source: No
pt_br: Não

source: Background CSS style
pt_br: Estilo CSS do fundo

source: CSS style for the background when the popup is active. See the documentation for Popup CSS style for more information (the thumb/full URL variables aren't supported here)
pt_br: Estilo CSS para o fundo quando o popup está ativo. Consulte a documentação do Estilo CSS do Popup para mais informações (as variáveis thumb/full URL não são suportadas aqui)

source: Background fade
pt_br: Fade (esmaecimento) do fundo

source: Fade in/out time (in milliseconds) for the page background, set to 0 to disable
pt_br: Tempo de fade in/out (em milissegundos) para o fundo da página, defina como 0 para desativar

source: Button CSS style
pt_br: Estilo CSS dos botões

source: Custom CSS styles for the popup's UI buttons. See the documentation for Popup CSS style for more information (the thumb/full URL variables aren't supported here)
pt_br: Estilos CSS personalizados para os botões da interface do popup. Consulte a documentação do Estilo CSS do Popup para obter mais informações (as variáveis thumb/full URL não são suportadas aqui)

source: Don't popup blacklisted URLs
pt_br: Não exibir URLs na lista negra em popup

source: This option popping up for source media with blacklisted URLs. If this is disabled, the popup will open if the end URL isn't blacklisted, regardless of whether the source is blacklisted.
pt_br: Essa opção impede a exibição em popup de mídia de origem com URLs na lista negra. Se desativada, o popup abrirá se a URL final não estiver na lista negra, independentemente da origem estar ou não.

source: Use media blacklist for host websites
pt_br: Usar lista negra de mídia para sites de hospedagem

source: Overrides the host blacklist to use the media blacklist (specified under Rules)
pt_br: Substitui a lista negra de hosts para usar a lista negra de mídia (especificada em Regras)

source: Don't popup different media type
pt_br: Não exibir tipo de mídia diferente em popup

source: This option prevents the popup from loading a video when the source was an image or vice-versa
pt_br: Esta opção impede que o popup carregue um vídeo quando a fonte for uma imagem ou vice-versa

source: Allow popup when fullscreen
pt_br: Permitir popup em tela cheia

source: Allows the popup to open if an element (such as a video player) is fullscreen.
pt_br: Permite que o popup seja aberto se um elemento (como um player de vídeo) estiver em tela cheia.

source: Element finding mode
pt_br: Modo de localização de elemento

source: How IMU should find the media element on the page.
pt_br: Como o maxurl deve encontrar o elemento de mídia na página.

source: This will result in a much higher CPU load for websites such as Facebook, and will occasionally return the wrong element. Use this option with caution.
pt_br: Isso resultará em uma carga de CPU muito maior para sites como o Facebook e ocasionalmente retornará o elemento errado. Use esta opção com cautela.

source: Full
pt_br: Completo

source: Manually looks through every element on the page to see if the cursor is above them. This will result in a higher CPU load for websites such as Facebook, and may return the wrong element
pt_br: Procura manualmente por cada elemento na página para ver se o cursor está sobre eles. Isso resultará em uma maior carga de CPU para sites como o Facebook e pode retornar o elemento errado

source: Hybrid
pt_br: Híbrido

source: Looks manually through every child element of the last element found by `getElementsAtPoint`. Use this option if in doubt, it'll work on most sites
pt_br: Procura manualmente em cada elemento filho do último elemento encontrado por `getElementsAtPoint`. Use esta opção em caso de dúvida, funcionará na maioria dos sites

source: Simple
pt_br: Simples

source: This is the fastest option, which uses the value of `getElementsAtPoint` without modification. Works for sites that don't use pointer-events:none and shadow DOM
pt_br: Esta é a opção mais rápida, que usa o valor de `getElementsAtPoint` sem modificação. Funciona para sites que não usam pointer-events: none e shadow DOM

source: Use cache
pt_br: Usar cache

source: Allows use of a media cache for the popup. The cache is currently stored per-page and is not persistent across page reloads.
pt_br: Permite o uso de um cache de mídia para o popup. O cache é armazenado por página e não é persistente entre recarregamentos de página.

source: Cache duration
pt_br: Duração do cache

source: How long for media to remain cached. Set to `0` for unlimited.
pt_br: Por quanto tempo a mídia permanecerá em cache. Defina como `0` para ilimitado.

source: minutes
pt_br: minutos

source: Cache item limit
pt_br: Limite de itens no cache

source: Maximum number of individual media to remain cached. Set to `0` for unlimited.
pt_br: Número máximo de mídias individuais para permanecerem em cache. Defina como `0` para ilimitado.

source: items
pt_br: itens

source: Resume videos
pt_br: Retomar vídeos

source: If a video popup was closed then reopened, the video will resume from where it left off
pt_br: Se um popup de vídeo foi fechado e reaberto, o vídeo será retomado de onde parou

source: Use userscript
pt_br: Usar script do usuário

source: Replaces the website's IMU instance with the userscript
pt_br: Substitui a instância do maxurl do site pelo script do usuário

source: Website image preview
pt_br: Prévia da imagem no site

source: Enables a preview of the image on the Image Max URL website
pt_br: Habilita a prévia da imagem no site Image Max URL

source: IMU entry in context menu
pt_br: Entrada do maxurl no menu de contexto

source: Enables a custom entry for this extension in the right click/context menu
pt_br: Habilita uma entrada personalizada para esta extensão no menu de contexto/clique com o botão direito

source: Hot (re)load
pt_br: (Re)carregamento dinâmico

source: (Re)loads the extension on all existing pages when installing or updating
pt_br: (Re)carrega a extensão em todas as páginas existentes ao instalar ou atualizar

source: Custom XHR for libraries
pt_br: XHR personalizado para bibliotecas

source: Allows the use of more powerful XHR (network requests) for 3rd-party libraries. This allows for certain DASH streams to work.
pt_br: Permite o uso de XHR (solicitações de rede) mais poderosos para bibliotecas de terceiros. Isso permite que certos fluxos DASH funcionem.

source: Allows the use of more powerful XHR (network requests) for 3rd-party libraries. This allows for certain DASH streams to work. Using this with the userscript version currently poses a potential security risk.
pt_br: Permite o uso de XHR (solicitações de rede) mais poderosos para bibliotecas de terceiros. Isso permite que certos fluxos DASH funcionem. Usar isso com a versão do script do usuário atualmente representa um risco potencial à segurança.

source: Instagram (downloading)
pt_br: Instagram (download)

source: Bypass CSP for libraries
pt_br: Ignorar CSP para bibliotecas

source: Tries loading the 3rd-party libraries using a `<script>` tag if a page's CSP prevents it from being loaded normally. This option currently carries an increased security risk when combined with "Custom XHR for libraries", and should only be enabled if absolutely necessary.
pt_br: Tenta carregar as bibliotecas de terceiros usando uma tag <script> se o CSP de uma página impedir que seja carregada normalmente. Atualmente, esta opção acarreta um risco de segurança aumentado quando combinada com "XHR Personalizado para bibliotecas" e só deve ser ativada se absolutamente necessário.

source: This can potentially be extremely insecure if "Custom XHR for libraries" is also enabled. A malicious website could gain extension-level permissions and perform arbitrary requests (your online accounts could get hacked). If you need to use this option, please disable it as soon as possible.
pt_br: Isso pode ser extremamente inseguro se "XHR Personalizado para bibliotecas" também estiver ativado. Um website malicioso pode obter permissões de nível de extensão e realizar solicitações arbitrárias (suas contas online podem ser invadidas). Se precisar usar esta opção, desative-a assim que possível.

source: Use Web Archive for libraries
pt_br: Usar Web Archive para bibliotecas

source: Uses archive.org's web archive instead of github for libraries and other script internals (such as the options page). Don't enable this unless you need to.
pt_br: Usa o arquivo web do archive.org em vez do github para bibliotecas e outros componentes internos do script (como a página de opções). Não ative isso a menos que seja necessário.

source: Enable integrity checks
pt_br: Habilitar verificações de integridade

source: Runs integrity checks before loading 3rd-party libraries
pt_br: Executa verificações de integridade antes de carregar bibliotecas de terceiros

source: HLS/DASH maximum quality
pt_br: Qualidade máxima HLS/DASH

source: Uses the maximum quality for HLS/DASH streams
pt_br: Usa a qualidade máxima para fluxos HLS/DASH

source: Maximum video quality
pt_br: Qualidade máxima do vídeo

source: Maximum quality for videos
pt_br: Qualidade máxima para vídeos

source: (unlimited)
pt_br: (ilimitado)

source: Larger watermarked images
pt_br: Imagens maiores com marca d'água

source: Enables rules that return larger images that include watermarks
pt_br: Habilita regras que retornam imagens maiores que incluem marcas d'água

source: Stock photo websites
pt_br: Sites de fotos de banco de imagens

source: Smaller non-watermarked images
pt_br: Imagens menores sem marca d'água

source: Enables rules that return smaller images without watermarks
pt_br: Habilita regras que retornam imagens menores sem marcas d'água

source: Possibly different images
pt_br: Imagens possivelmente diferentes

source: Enables rules that return images that possibly differ, usually due to server-side caching
pt_br: Habilita regras que retornam imagens que podem ser diferentes, geralmente devido ao cache do lado do servidor

source: Possibly broken images
pt_br: Imagens possivelmente quebradas

source: Enables rules that return images that are possibly broken
pt_br: Habilita regras que retornam imagens que podem estar quebradas

source: Possibly upscaled images
pt_br: Imagens possivelmente ampliadas

source: Enables rules that return images that are possibly upscaled
pt_br: Habilita regras que retornam imagens que podem ter sido ampliadas

source: Uncropped images
pt_br: Imagens não cortadas
