Repository: louisje/maxurl
Catalog: po/*.po
Languages: pt_br

source: <p>Variables are specified between curly brackets (<code>{}</code>).</p> <p>Below is a list of valid variables:</p> <ul><br /> <li><code>filename</code> - Original filename (with extension, if applicable)</li> <li><code>filename_noext</code> - Original filename (without extension, if applicable)</li> <li><code>ext</code> - Extension (with <code>.</code> prefixed)</li> <li><code>caption</code> - Popup caption</li> <li><code>author_username</code> - Author's username</li> <li><code>id</code> - Post ID</li> <li><code>host_title</code> - Title of the current tab/window</li> <li><code>host_url</code> - URL of the host webpage</li> <li><code>host_domain</code> - Domain of the host webpage</li> <li><code>host_domain_nosub</code> - Domain (without subdomains) of the host webpage</li> <li><code>url</code> - URL of the media</li> <li><code>domain</code> - Domain of the media</li> <li><code>domain_nosub</code> - Domain (without subdomains) of the media</li> <li><code>is_screenshot</code> - Blank, the line will only be processed when screenshotting a video</li> <li><code>prefix</code>, <code>suffix</code> - Blank by default, these variables will be automatically prefixed/suffixed to the filename if set using <code>:=</code></li> <li><code>created_...</code> - Created date (see note on Date objects below)</li> <li><code>updated_...</code> - Updated date, this will use the <code>Last-Modified</code> header if not otherwise specified by the rule (see note on Date objects below)</li> <li><code>download_...</code> - Download date (see note on Date objects below)</li> <li><code>date_...</code> - Created/updated date (see note on Date objects below)</li> </ul><br /> <p>You can truncate the value of a variable by adding <code>:(number)</code> before the end bracket (<code>}</code>). For example:</p> <ul><br /> <li><code>{caption:10}</code> - Truncates the caption to be at most 10 characters long</li> <li><code>{caption:10.}</code> - Same, but will add an ellipsis (…) if the caption was truncated</li> </ul><br /> <p>If a variable doesn't exist, by default it will ignore the current format string and use the one on the next line, unless <code>?</code> is added before the end bracket. For example:</p> <ul><br /> <li><code>{ext?}</code> - Will be replaced with nothing if <code>ext</code> doesn't exist</li> <li><code>{caption?no caption}</code> - Will be replaced with <code>no caption</code> if <code>caption</code> doesn't exist</li> </ul><br /> <p>You can check for equality and inequality with <code>==</code> and <code>!=</code> operators respectively. For example:</p> <ul><br /> <li><code>{domain_nosub==cdninstagram.com}{author_username} {id}</code> - Will only run the current format (<code>{author_username} {id}</code> in this case) if the domain is cdninstagram.com</li> </ul><br /> <p>You can check if a variable contains a string with <code>/=</code> (<code>!/=</code> for the opposite). It also supports two flags, <code>r</code> (regex) and <code>c</code> (case-sensitive), if added between <code>/</code> and <code>=</code>. For example:</p> <ul><br /> <li><code>{domain/=instagram}{id}</code> - Will only run the current format (<code>{id}</code>) if the domain contains <code>instagram</code></li> <li><code>{domain!/=instagram}{id}</code> - Likewise, but only if the domain does not contain <code>instagram</code></li> <li><code>{domain/r=inst.*ram}{id}</code> - Likewise, but only if the domain matches the regex <code>inst.*ram</code></li> <li><code>{window_title/c=Instagram}{id}</code> - Likewise, but only if the window's title contains <code>Instagram</code> (case-sensitively)</li> <li><code>{window_title!/rc=Inst.*ram}{id}</code> - Likewise, but only if the window's title does not match the case-sensitive regex <code>Inst.*ram</code></li> </ul><br /> <p>You can set a custom variable with <code>:=</code>. For example:</p> <ul><br /> <li><code>{domain_nosub==cdninstagram.com}{foo:=bar}</code> - Sets the variable <code>foo</code> to <code>bar</code> if the domain is <code>cdninstagram.com</code>. The variable can then be accessed with e.g. <code>{foo}</code></li> </ul><br /> <p>Date objects are accessible through a number of properties. Each property can be suffixed with <code>_utc</code> to get the UTC/GMT equivalent.</p> <ul><br /> <li><code>..._iso</code> - Date in ISO format (e.g. <code>2019-12-31T23-30-56</code>). Note that <code>:</code> is replaced with <code>-</code> to avoid issues with paths under NTFS.</li> <li><code>..._ago</code> - Human-readable representation of the time elapsed since the date (e.g. <code>1 year and 10 months ago</code>, <code>5 months and 20 days ago</code>)</li> <li><code>..._unix</code> - Unix timestamp (e.g. <code>1577912345</code>)</li> <li><code>..._unix_ms</code> - Unix timestamp with millisecond accuracy (e.g. <code>1577912345678</code>)</li> <li><code>..._yyyymmdd</code> - Date in YYYYMMDD format (e.g. <code>20191230</code>)</li> <li><code>..._hhmmss</code> - Time in HHMMSS format (e.g. <code>233056</code>)</li> <li><code>..._year</code> - Full year (e.g. <code>2019</code>)</li> <li><code>..._month</code> - Zero-padded month (e.g. <code>12</code>)</li> <li><code>..._day</code> - Zero-padded day (e.g. <code>31</code>)</li> <li><code>..._hours</code> - Zero-padded hours in military/24-hour format (e.g. <code>23</code>)</li> <li><code>..._minutes</code> - Zero-padded minutes (e.g. <code>30</code>)</li> <li><code>..._seconds</code> - Zero-padded seconds (e.g. <code>56</code>)</li> </ul>
pt_br: As variáveis são especificadas entre chaves (<code>{}</code>).</p> <p>Abaixo está uma lista de variáveis válidas:</p> <ul><br /> <li><code>filename</code> - Nome do arquivo original (com extensão, se aplicável)</li> <li><code>filename_noext</code> - Nome do arquivo original (sem extensão, se aplicável)</li> <li><code>ext</code> - Extensão (prefixada com <code>.</code>)</li> <li><code>caption</code> - Legenda do popup</li> <li><code>author_username</code> - Nome de usuário do autor</li> <li><code>id</code> - ID do post</li> <li><code>host_title</code> - Título da aba/janela atual</li> <li><code>host_url</code> - URL da página de hospedagem</li> <li><code>host_domain</code> - Domínio da página de hospedagem</li> <li><code>host_domain_nosub</code> - Domínio (sem subdomínios) da página de hospedagem</li> <li><code>url</code> - URL da mídia</li> <li><code>domain</code> - Domínio da mídia</li> <li><code>domain_nosub</code> - Domínio (sem subdomínios) da mídia</li> <li><code>is_screenshot</code> - Em branco, a linha só será processada ao fazer uma captura de tela de um vídeo</li> <li><code>prefix</code>, <code>suffix</code> - Em branco por padrão, essas variáveis serão automaticamente prefixadas/sufixadas ao nome do arquivo se definidas usando <code>:=</code></li> <li><code>created_...</code> - Data de criação (veja a nota sobre objetos de data abaixo)</li> <li><code>updated_...</code> - Data de atualização, usará o cabeçalho <code>Last-Modified</code> se não especificado de outra forma pela regra (veja a nota sobre objetos de data abaixo)</li> <li><code>download_...</code> - Data de download (veja a nota sobre objetos de data abaixo)</li> <li><code>date_...</code> - Data de criação/atualização (veja a nota sobre objetos de data abaixo)</li> </ul><br /> <p>Você pode truncar o valor de uma variável adicionando <code>:(número)</code> antes da chave de fechamento (<code>}</code>). Por exemplo:</p> <ul><br /> <li><code>{caption:10}</code> - Trunca a legenda para ter no máximo 10 caracteres</li> <li><code>{caption:10.}</code> - O mesmo, mas adicionará uma reticência (…) se a legenda for truncada</li> </ul><br /> <p>Se uma variável não existir, por padrão ignorará a string de formato atual e usará a próxima linha, a menos que <code>?</code> seja adicionado antes da chave de fechamento. Por exemplo:</p> <ul><br /> <li><code>{ext?}</code> - Será substituído por nada se <code>ext</code> não existir</li> <li><code>{caption?sem legenda}</code> - Será substituído por <code>sem legenda</code> se <code>caption</code> não existir</li> </ul><br /> <p>Você pode verificar igualdade e desigualdade com os operadores <code>==</code> e <code>!=</code> respectivamente. Por exemplo:</p> <ul><br /> <li><code>{domain_nosub==cdninstagram.com}{author_username} {id}</code> - Executará o formato atual (<code>{author_username} {id}</code> neste caso) apenas se o domínio for cdninstagram.com</li> </ul><br /> <p>Você pode verificar se uma variável contém uma string com <code>/=</code> (<code>!/=</code> para o oposto). Também suporta duas flags, <code>r</code> (regex) e <code>c</code> (case-sensitive), se adicionadas entre <code>/</code> e <code>=</code>. Por exemplo:</p> <ul><br /> <li><code>{domain/=instagram}{id}</code> - Executará o formato atual (<code>{id}</code>) apenas se o domínio contiver <code>instagram</code></li> <li><code>{domain!/=instagram}{id}</code> - Da mesma forma, mas apenas se o domínio não contiver <code>instagram</code></li> <li><code>{domain/r=inst.*ram}{id}</code> - Da mesma forma, mas apenas se o domínio corresponder ao regex <code>inst.*ram</code></li> <li><code>{window_title/c=Instagram}{id}</code> - Da mesma forma, mas apenas se o título da janela contiver <code>Instagram</code> (diferenciação de maiúsculas e minúsculas)</li> <li><code>{window_title!/rc=Inst.*ram}{id}</code> - Da mesma forma, mas apenas se o título da janela não corresponder ao regex case-sensitive <code>Inst.*ram</code></li> </ul><br /> <p>Você pode definir uma variável personalizada com <code>:=</code>. Por exemplo:</p> <ul><br /> <li><code>{domain_nosub==cdninstagram.com}{foo:=bar}</code> - Define a variável <code>foo</code> como <code>bar</code> se o domínio for <code>cdninstagram.com</code>. A variável pode então ser acessada com, por exemplo, <code>{foo}</code></li> </ul><br /> <p>Objetos de data são acessíveis através de várias propriedades. Cada propriedade pode ser sufixada com <code>_utc</code> para obter o equivalente UTC/GMT.</p> <ul><br /> <li><code>..._iso</code> - Data em formato ISO (ex.: <code>2019-12-31T23-30-56</code>). Observe que <code>:</code> é substituído por <code>-</code> para evitar problemas com caminhos no NTFS.</li> <li><code>..._ago</code> - Representação legível do tempo decorrido desde a data (ex.: <code>1 ano e 10 meses atrás</code>, <code>5 meses e 20 dias atrás</code>)</li> <li><code>..._unix</code> - Timestamp Unix (ex.: <code>1577912345</code>)</li> <li><code>..._unix_ms</code> - Timestamp Unix com precisão de milissegundos (ex.: <code>1577912345678</code>)</li> <li><code>..._yyyymmdd</code> - Data em formato YYYYMMDD (ex.: <code>20191230</code>)</li> <li><code>..._hhmmss</code> - Hora em formato HHMMSS (ex.: <code>233056</code>)</li> <li><code>..._year</code> - Ano completo (ex.: <code>2019</code>)</li> <li><code>..._month</code> - Mês com zero à esquerda (ex.: <code>12</code>)</li> <li><code>..._day</code> - Dia com zero à esquerda (ex.: <code>31</code>)</li> <li><code>..._hours</code> - Horas com zero à esquerda no formato militar/24 horas (ex.: <code>23</code>)</li> <li><code>..._minutes</code> - Minutos com zero à esquerda (ex.: <code>30</code>)</li> <li><code>..._seconds</code> - Segundos com zero à esquerda (ex.: <code>56</code>)</li> </ul>

source: Replace special characters with underscores
pt_br: Substituir caracteres especiais por underlines

source: Replaces characters such as `/` or `"` with `_` when downloading. Note that browsers will usually do this automatically, this is just to ensure consistent behavior.
pt_br: Substitui caracteres como `/` ou `"` por `_` ao baixar. Observe que os navegadores geralmente fazem isso automaticamente, isso é apenas para garantir um comportamento consistente.

source: Trigger keybinding that will run the Replace Images function
pt_br: Atalho de teclado que executará a função Substituir Imagens

source: Automatically replace images
pt_br: Substituir imagens automaticamente

source: Automatically replace images to larger versions on pages you view
pt_br: Substituir automaticamente imagens por versões maiores nas páginas que você visualiza

source: This could lead to rate limiting or IP bans
pt_br: Isso pode levar a limitação de taxa ou banimento de IP

source: Use data URLs
pt_br: Usar URLs de dados

source: Uses data:// URLs instead of image links. Disabling this may improve compatibility with some bulk image downloader extensions
pt_br: Utiliza URLs data:// em vez de links de imagem. Desabilitar isso pode melhorar a compatibilidade com algumas extensões de download de imagens em massa

source: Wait until image is fully loaded
pt_br: Esperar até que a imagem seja totalmente carregada

source: Waits until the image being replaced is fully loaded before moving on to the next image
pt_br: Aguarda até que a imagem sendo substituída seja totalmente carregada antes de passar para a próxima imagem

source: Max images to process at once
pt_br: Máximo de imagens para processar de uma vez

source: The maximum amount of images to process at once
pt_br: A quantidade máxima de imagens para processar de uma vez

source: Max images per domain at once
pt_br: Máximo de imagens por domínio de uma vez

source: The maximum amount of images per domain to process at once
pt_br: A quantidade máxima de imagens por domínio para processar de uma vez

source: images
pt_br: imagens

source: Delay between same-domain images
pt_br: Atraso entre imagens do mesmo domínio

source: New requests for images in the same domain will be delayed by this amount of seconds. Useful for avoiding rate limits.
pt_br: Novas requisições para imagens no mesmo domínio serão atrasadas por esta quantidade de segundos. Útil para evitar limites de taxa.

source: seconds
pt_br: segundos

source: Replace images
pt_br: Substituir imagens

source: Replaces images to their larger versions when the button is pressed
pt_br: Substitui as imagens por suas versões maiores quando o botão é pressionado

source: Add links
pt_br: Adicionar links

source: Adds links around replaced media if a link doesn't already exist
pt_br: Adiciona links ao redor da mídia substituída se um link ainda não existir

source: Replace links
pt_br: Substituir links

source: Replaces links if they already exist
pt_br: Substitui links se eles já existirem

source: Plain hyperlinks
pt_br: Hiperlinks simples

source: How to treat plain (non-media) hyperlinks that link to potential media
pt_br: Como tratar hiperlinks simples (não mídia) que ligam para mídias em potencial

source: Replace link+text
pt_br: Substituir link+texto

source: Replace media
pt_br: Substituir mídia

source: Links open in new tab
pt_br: Links abrem em nova aba

source: Clicking on a replaced link will open the media in a new tab
pt_br: Clicar em um link substituído abrirá a mídia em uma nova aba

source: Size constraints
pt_br: Restrições de tamanho

source: Removes or enforces height/width specifiers for replaced media
pt_br: Remove ou aplica especificadores de altura/largura para mídia substituída

source: Ignore
pt_br: Ignorar

source: Remove
pt_br: Remover

source: Force
pt_br: Forçar

source: Replacement CSS
pt_br: CSS de Substituição

source: CSS styles to apply to replaced media. See the documentation for Popup CSS style for more information (the thumb/full URL variables aren't yet supported here)
pt_br: Estilos CSS para aplicar à mídia substituída. Consulte a documentação para o estilo CSS de Popup para mais informações (as variáveis thumb/full URL ainda não são suportadas aqui)

source: Simple progress
pt_br: Progresso simples

source: Uses a simpler progress bar that has a fixed size for all media. This is useful to see how many images are replaced, rather than the ETA
pt_br: Utiliza uma barra de progresso mais simples com tamanho fixo para todas as mídias. Isso é útil para ver quantas imagens são substituídas, em vez do tempo estimado de conclusão

source: Trigger keybinding that will run the Highlight Images function
pt_br: Atalho de teclado que executará a função 'Destacar Imagens'

source: Enables the 'Highlight Images' button
pt_br: Habilita o botão 'Destacar Imagens'

source: Automatically highlight images
pt_br: Destacar imagens automaticamente

source: Automatically highlights images as you view pages
pt_br: Destaca automaticamente as imagens enquanto você visualiza as páginas

source: Always
pt_br: Sempre

source: Hover
pt_br: Ao passar o mouse

source: When hovering over an image
pt_br: Ao passar o mouse sobre uma imagem

source: Never
pt_br: Nunca

source: Only explicitly supported images
pt_br: Apenas imagens explicitamente suportadas

source: Only highlights images that can be made larger or the original version can be found
pt_br: Destaca apenas imagens que podem ser ampliadas ou cuja versão original pode ser encontrada

source: Highlight CSS
pt_br: CSS de Destaque

source: CSS style to apply for highlight. See the documentation for Popup CSS style for more information (the thumb/full URL variables aren't supported here)
pt_br: Estilo CSS para aplicar ao destaque. Consulte a documentação para o estilo CSS de Popup para mais informações (as variáveis thumb/full URL não são suportadas aqui)

source: Enable trigger key
pt_br: Habilitar tecla de disparo

source: Enables the use of the trigger key to run it without needing to use the menu
pt_br: Habilita o uso da tecla de disparo para executar a função sem precisar usar o menu

source: Trigger key
pt_br: Tecla de disparo

source: Trigger keybinding that will run the Custom Gallery function
pt_br: Atalho de teclado que executará a função 'Galeria Personalizada'

source: Enable button
pt_br: Habilitar botão

source: Enables the 'Custom Gallery' button
pt_br: Habilita o botão 'Galeria Personalizada'

source: Apply key
pt_br: Tecla de aplicação

source: Triggers the gallery when pressed
pt_br: Aciona a galeria quando pressionada

source: Background CSS
pt_br: CSS de Fundo

source: CSS style to apply for the background
pt_br: Estilo CSS para aplicar ao fundo

source: Outline CSS
pt_br: CSS de Contorno

source: CSS style to apply for element outlines
pt_br: Estilo CSS para aplicar aos contornos dos elementos

source: Mouseover popup action
pt_br: Ação do popup ao passar o mouse

source: Determines how the mouseover popup will open
pt_br: Determina como o popup ao passar o mouse será aberto

source: New tab
pt_br: Nova aba

source: New background tab
pt_br: Nova aba em segundo plano

source: Download
pt_br: Baixar

source: Copy link
pt_br: Copiar link

source: Replace
pt_br: Substituir

source: Exclude page background
pt_br: Excluir plano de fundo da página

source: Excludes the page background for the popup
pt_br: Exclui o plano de fundo da página para o popup

source: Minimum size
pt_br: Tamanho mínimo

source: Smallest size acceptable for the popup to open (this option is ignored for background images). This refers to the size of the media to be popped up, which may differ from the source media.
pt_br: Menor tamanho aceitável para o popup abrir (esta opção é ignorada para imagens de fundo). Refere-se ao tamanho da mídia a ser exibida no popup, que pode ser diferente da mídia de origem.

source: Maximum source size
pt_br: Tamanho máximo da origem

source: Maximum size (width/height) for the source media to allow popping up (this option is ignored for background images). Set to `0` for any size.
pt_br: Tamanho máximo (largura/altura) para a mídia de origem permitir a exibição em popup (esta opção é ignorada para imagens de fundo). Defina como `0` para qualquer tamanho.

source: Exclude `background-image`s
pt_br: Excluir imagens de fundo

source: Excludes `background-image`s for the popup. Might prevent the popup from working on many images
pt_br: Exclui imagens de fundo (`background-image`) do popup. Pode impedir que o popup funcione em muitas imagens

source: Enable videos
pt_br: Habilitar vídeos

source: Allows videos to be popped up
pt_br: Permite que vídeos sejam exibidos em popup

source: Enable audio
pt_br: Habilitar áudio

source: Allows audio to be popped up. Currently experimental. This only applies to audio files. Videos that contains audio are supported regardless of this setting.
pt_br: Permite que áudio seja exibido em popup. Atualmente experimental. Isso se aplica apenas a arquivos de áudio. Vídeos que contêm áudio são suportados independentemente desta configuração.

source: Allow HLS/DASH streams
pt_br: Permitir streams HLS/DASH

source: Allows playback of HLS/DASH streams
pt_br: Permite a reprodução de streams HLS/DASH

source: Instagram (higher quality)
pt_br: Instagram (maior qualidade)

source: YouTube (higher quality)
pt_br: YouTube (maior qualidade)
