Repository: louisje/maxurl
Catalog: po/*.po
Languages: pt_br

source: Key to toggle mute
pt_br: Tecla para alternar para mudo

source: Default volume
pt_br: Volume padrão

source: Default volume for the media
pt_br: Volume padrão para a mídia

source: Volume up key
pt_br: Tecla de aumentar o volume

source: Key to increase the volume
pt_br: Tecla para aumentar o volume

source: Volume down key
pt_br: Tecla de diminuir o volume

source: Key to decrease the volume
pt_br: Tecla para diminuir o volume

source: Volume change amount
pt_br: Quantidade de alteração de volume

source: Percent for volume to increase/decrease when using the volume up/down keys
pt_br: Percentual para aumentar/diminuir o volume ao usar as teclas de aumentar/diminuir volume

source: Resume playback from source
pt_br: Retomar reprodução do vídeo original

source: If enabled, playback will resume from where the source left off
pt_br: Se ativado, a reprodução continuará de onde o vídeo original parou

source: Resume if different length
pt_br: Retomar se a duração for diferente

source: If disabled, it will not resume if the source has a different length from the media in the popup (e.g. from a preview video to a full one)
pt_br: Se desativado, não retomará a reprodução se o vídeo original tiver uma duração diferente da mídia no pop-up (por exemplo, de um vídeo de visualização para um vídeo completo).

source: Pause source
pt_br: Pausar vídeo original

source: Pauses the source once the popup has opened
pt_br: Pausa o vídeo original assim que o pop-up for aberto

source: Seek amount
pt_br: Quantidade de avanço/retrocesso

source: Amount of time to seek forward/back when using the seek keys
pt_br: Quantidade de tempo para avançar/retroceder ao usar as teclas de avanço/retrocesso

source: Seek left key
pt_br: Tecla de retrocesso

source: Key to seek backwards by the specified amount
pt_br: Tecla para retroceder a quantidade especificada

source: Seek right key
pt_br: Tecla de avanço

source: Key to seek forwards by the specified amount
pt_br: Tecla para avançar a quantidade especificada

source: Previous frame key
pt_br: Tecla de voltar quadro

source: Rewinds the video one "frame" backward. Due to current limitations, the frame size is static (but configurable), and might not match the video's framerate
pt_br: Retrocede o vídeo um "quadro" para trás. Devido às limitações atuais, o tamanho do quadro é estático (mas configurável) e pode não corresponder à taxa de quadros do vídeo

source: Next frame key
pt_br: Tecla de avançar quadro

source: Advances the video one "frame" forward. Due to current limitations, the frame size is static (but configurable), and might not match the video's framerate
pt_br: Avança o vídeo um "quadro" para frente. Devido às limitações atuais, o tamanho do quadro é estático (mas configurável) e pode não corresponder à taxa de quadros do vídeo

source: Frame rate
pt_br: Taxa de quadros

source: Frame rate for videos to seek forward/back with the next/previous frame keys
pt_br: Taxa de quadros para vídeos avançarem/retrocederem com as teclas de próximo/anterior quadro

source: FPS
pt_br: FPS (Quadros por Segundo)

source: Speed down key
pt_br: Tecla para diminuir a velocidade

source: Key to decrease playback rate by a specified amount
pt_br: Tecla para diminuir a taxa de reprodução em uma quantidade especificada

source: Speed up key
pt_br: Tecla para aumentar a velocidade

source: Key to increase playback rate by a specified amount
pt_br: Tecla para aumentar a taxa de reprodução em uma quantidade especificada

source: Speed up/down amount
pt_br: Quantidade de aumento/diminuição de velocidade

source: How much to increase/decrease the playback rate
pt_br: Quanto aumentar/diminuir a taxa de reprodução

source: Reset speed key
pt_br: Tecla para redefinir a velocidade

source: Resets the playback rate to normal speed
pt_br: Redefine a taxa de reprodução para a velocidade normal

source: Screenshot key
pt_br: Tecla para captura de tela

source: Screenshots the current frame in the video
pt_br: Captura o quadro atual do vídeo

source: Screenshot format
pt_br: Formato da captura de tela

source: File format to save the screenshot in
pt_br: Formato de arquivo para salvar a captura de tela

source: Enable subtitles
pt_br: Ativar legendas

source: Enables subtitles to be overlayed on top of the video
pt_br: Permite que as legendas sejam sobrepostas ao vídeo

source: Popup UI
pt_br: Interface de Pop-up

source: Enables a UI on top of the popup
pt_br: Habilita uma interface na parte superior do pop-up

source: UI Toggle key
pt_br: Tecla para alternar a interface

source: Toggles the display of the UI
pt_br: Alterna a exibição da interface

source: Opacity
pt_br: Opacidade

source: Opacity of the UI on top of the popup
pt_br: Opacidade da interface sobre o pop-up

source: Use safe glyphs
pt_br: Usar glifos seguros

source: Uses glyphs that are more likely to be available on all fonts. Enable this option if the following characters render as boxes: 🡇 🡐 🡒. The 'Noto Sans Symbols2' font contains these characters.
pt_br: Usa glifos que são mais propensos a estarem disponíveis em todas as fontes. Habilite esta opção se os seguintes caracteres forem exibidos como caixas: 🡇 🡐 🡒. A fonte 'Noto Sans Symbols2' contém estes caracteres.

source: Media resolution
pt_br: Resolução da mídia

source: Displays the original media dimensions on top of the UI. CSS ID: `#sizeinfo`
pt_br: Exibe as dimensões originais da mídia no topo da UI. ID CSS: `#sizeinfo`

source: Zoom percent
pt_br: Percentual de zoom

source: Displays the current zoom level on top of the UI. CSS ID: `#sizeinfo`
pt_br: Exibe o nível de zoom atual no topo da UI. ID CSS: `#sizeinfo`

source: File size
pt_br: Tamanho do arquivo

source: Displays the media's file size on top of the UI. For the moment, this will not work with partially loaded media if 'Avoid HEAD request for partially loaded media' is enabled. CSS ID: `#sizeinfo`
pt_br: Exibe o tamanho do arquivo de mídia no topo da UI. No momento, isso não funcionará com mídia carregada parcialmente se 'Evitar solicitação HEAD para mídia carregada parcialmente' estiver habilitado. ID CSS: `#sizeinfo`

source: Gallery counter
pt_br: Contador da galeria

source: Enables a gallery counter on top of the UI. CSS ID: `#gallerycounter`
pt_br: Habilita um contador da galeria no topo da UI. ID CSS: `#gallerycounter`

source: Gallery counter max
pt_br: Máximo do contador da galeria

source: Maximum amount of images to check in the counter (this can be slightly CPU-intensive)
pt_br: Quantidade máxima de imagens a verificar no contador (isso pode exigir um pouco de CPU)

source: Gallery buttons
pt_br: Botões da galeria

source: Enables buttons to go left/right in the gallery. CSS IDs: `#galleryprevbtn`, `#gallerynextbtn`
pt_br: Habilita botões para ir à esquerda/direita na galeria. IDs CSS: `#galleryprevbtn`, `#gallerynextbtn`

source: Close Button
pt_br: Botão Fechar

source: Enables a button to close the popup. CSS ID: `#closebtn`
pt_br: Habilita um botão para fechar o popup. ID CSS: `#closebtn`

source: Options Button
pt_br: Botão de Opções

source: Enables a button to go to this page. CSS ID: `#optionsbtn`
pt_br: Habilita um botão para ir para esta página. ID CSS: `#optionsbtn`

source: Download Button
pt_br: Botão de Download

source: Enables a button to download the image. CSS ID: `#downloadbtn`
pt_br: Habilita um botão para baixar a imagem. ID CSS: `#downloadbtn`

source: Rotation Buttons
pt_br: Botões de Rotação

source: Enables buttons on the UI to rotate the image by 90 degrees. CSS IDs: `#rotleftbtn`, `#rotrightbtn`
pt_br: Habilita botões na UI para girar a imagem em 90 graus. IDs CSS: `#rotleftbtn`, `#rotrightbtn`

source: Caption
pt_br: Legenda

source: Shows the image's caption (if available) at the top. CSS ID: `#caption`
pt_br: Mostra a legenda da imagem (se disponível) no topo. ID CSS: `#caption`

source: Wrap caption text
pt_br: Quebrar texto da legenda

source: Wraps the caption if it's too long
pt_br: Quebra a legenda se for muito longa

source: Link original page in caption
pt_br: Vincular página original na legenda

source: Links the original page (if it exists) in the caption
pt_br: Vincula a página original (se existir) na legenda

source: Underline links
pt_br: Sublinhar links

source: Adds an underline to links (such as the original page)
pt_br: Adiciona um sublinhado aos links (como o da página original)

source: Keep popup open until
pt_br: Manter pop-up aberto até

source: Closes the popup when the selected condition is met
pt_br: Fecha o pop-up quando a condição selecionada for atendida

source: Any trigger is released
pt_br: Qualquer gatilho for liberado

source: All triggers are released
pt_br: Todos os gatilhos forem liberados

source: ESC/Close is pressed
pt_br: ESC/Fechar for pressionado

source: Don't close until mouse leaves
pt_br: Não fechar até o mouse sair

source: If true, this keeps the popup open even if all triggers are released if the mouse is still over the image
pt_br: Se verdadeiro, mantém o pop-up aberto mesmo que todos os gatilhos sejam liberados se o mouse ainda estiver sobre a imagem

source: Threshold to leave image
pt_br: Limite para sair da imagem

source: How many pixels outside of the image before the cursor is considered to have left the image
pt_br: Quantos pixels fora da imagem antes que o cursor seja considerado como tendo deixado a imagem

source: Leaving thumbnail cancels loading
pt_br: Sair da miniatura cancela o carregamento

source: Cancels the current popup loading when the cursor has left the thumbnail image
pt_br: Cancela o carregamento do pop-up atual quando o cursor sai da imagem em miniatura

source: ESC cancels loading
pt_br: ESC cancela carregamento

source: Cancels the current popup loading if ESC is pressed
pt_br: Cancela o carregamento do pop-up atual se ESC for pressionado

source: Releasing triggers cancels loading
pt_br: Liberar gatilhos cancela carregamento

source: Cancels the current popup loading if all/any triggers are released (as set by the "Keep popup open until" setting)
pt_br: Cancela o carregamento do popup atual se todos/quaisquer gatilhos forem liberados (conforme definido pela configuração "Manter popup aberto até")

source: Automatically close after timeout
pt_br: Fechar automaticamente após tempo limite

source: Closes the popup automatically after a specified period of time has elapsed
pt_br: Fecha o pop-up automaticamente após um período de tempo especificado

source: Timeout to close popup
pt_br: Tempo limite para fechar o pop-up

source: Amount of time to elapse before automatically closing the popup
pt_br: Tempo para fechar o pop-up automaticamente

source: Hold key
pt_br: Tecla manter pressionado

source: Hold key that, when pressed, will keep the popup open
pt_br: Tecla que, quando pressionada, mantém o pop-up aberto

source: Center popup on hold
pt_br: Centralizar pop-up ao manter pressionado

source: Centers the popup to the middle of the page when the popup is held
pt_br: Centraliza o pop-up no meio da página quando ele for pressionado

source: Override zoom on hold
pt_br: Substituir zoom ao pressionar

source: Overrides the zoom when the popup is held
pt_br: Substitui o zoom quando o pop-up é mantido pressionado

source: Close popup on unhold
pt_br: Fechar pop-up ao liberar

source: Closes the popup when the hold key is pressed again, after having previously held the popup
pt_br: Fecha o pop-up quando a tecla de manter pressionado é usada novamente, após ter precionado a tecla de pop-up anteriormente

source: Enable pointer events on hold
pt_br: Habilitar eventos do ponteiro ao sustentar

source: Enables previously disabled pointer events when the popup is held
pt_br: Habilita eventos do ponteiro do mouse previamente desabilitados quando a tecla de pop-up é pressionada

source: Clicking outside the popup closes
pt_br: Clicar fora do pop-up fecha

source: Closes the popup when the mouse clicks outside of it
pt_br: Fecha o pop-up quando o mouse clica fora dele

source: Close when leaving
pt_br: Fechar ao sair

source: Closes the popup when the mouse leaves the thumbnail element, the popup, or both
pt_br: Fecha o pop-up quando o mouse sai do elemento da miniatura, do pop-up ou de ambos

source: Thumbnail
pt_br: Miniatura

source: Both
pt_br: Ambos

source: Use invisible element when waiting
pt_br: Usar elemento invisível ao aguardar

source: Creates an invisible element under the cursor when waiting for the popup instead of a style element (can improve performance on websites with many elements, but prevents the cursor from clicking anything while loading the popup)
pt_br: Cria um elemento invisível abaixo do cursor ao aguardar o pop-up em vez de um elemento de estilo (pode melhorar o desempenho em sites com muitos elementos, mas impede que o cursor clique em qualquer coisa durante o carregamento do pop-up)

source: Add popup link to history
pt_br: Adicionar link do pop-up ao histórico

source: Adds the image/video link opened through the popup to the browser's history
pt_br: Adiciona o link da imagem/vídeo aberto através do pop-up ao histórico do navegador

source: Add thumbnail link to history
pt_br: Adicionar link da miniatura ao histórico

source: Adds the original media link opened through the popup to the browser's history
pt_br: Adiciona o link original da mídia aberto através do pop-up ao histórico do navegador

source: Allow inter-frame communication
pt_br: Permitir comunicação entre frames

source: Allows communication between frames in windows, improving support for keybindings
pt_br: Permite a comunicação entre frames em janelas, melhorando o suporte para atalhos de teclado

source: Allows communication between frames in windows, improving support for keybindings. Can pose a fingerprinting risk when used through the userscript
pt_br: Permite a comunicação entre frames em janelas, melhorando o suporte para atalhos de teclado. Pode representar um risco de fingerprinting quando usado através do userscript

source: Pop out of frames
pt_br: Sair dos frames

source: Opens the popup on the top frame instead of within iframes. This option is still experimental.
pt_br: Abre o pop-up no frame superior em vez de dentro de iframes. Esta opção ainda é experimental.

source: Popup default zoom
pt_br: Zoom padrão do pop-up

source: How the popup should be initially sized
pt_br: Como deve ser o dimensionamento inicial do pop-up

source: Fit to screen
pt_br: Ajustar à tela

source: Fill screen
pt_br: Preencher tela

source: Full size
pt_br: Tamanho original

source: Custom size
pt_br: Tamanho personalizado

source: Custom zoom percent
pt_br: Percentual de zoom personalizado

source: Custom percent to initially size the popup
pt_br: Percentual personalizado para dimensionar o pop-up inicialmente

source: Use last zoom
pt_br: Usar último zoom

source: Use the last popup's zoom. Note that this is per-page.
pt_br: Usar o zoom do último pop-up. Observe que isso é por página.

source: Maximum width
pt_br: Largura máxima

source: Maximum width for the initial popup size. Set to `0` for unlimited.
pt_br: Largura máxima para o tamanho inicial do pop-up. Defina como `0` para ilimitado.

source: Maximum height
pt_br: Altura máxima

source: Maximum height for the initial popup size. Set to `0` for unlimited.
pt_br: Altura máxima para o tamanho inicial do pop-up. Defina como `0` para ilimitado.

source: Popup panning method
pt_br: Método de panorâmica do pop-up

source: How the popup should be panned when larger than the screen
pt_br: Como o pop-up deve ser deslocado quando maior que a tela

source: Movement
pt_br: Movimento

source: The popup pans as you move your mouse
pt_br: O pop-up se move conforme você move o mouse

source: Drag
pt_br: Arrastar

source: Clicking and dragging pans the popup
pt_br: 'Clicar e arrastar' move o pop-up

source: Invert movement
pt_br: Inverter movimento

source: Inverts the movement of the mouse. For example, if the mouse moves left, the popup moves right. If disabled, it feels more like the popup is being invisibly dragged.
pt_br: Inverte o movimento do mouse. Por exemplo, se o mouse se mover para a esquerda, o pop-up se move para a direita. Se desabilitado, parece que o pop-up está sendo arrastado de forma invisível.

source: Minimum drag amount
pt_br: Quantidade mínima a ser arrastada

source: How many pixels the mouse should move to start a drag
pt_br: Quantos pixels o mouse deve se mover para iniciar um arrasto

source: Vertical scroll action
pt_br: Ação de rolagem vertical

source: How the popup reacts to a vertical scroll/mouse wheel event
pt_br: Como o pop-up reage a um evento de rolagem vertical/roda do mouse

source: Vertical scroll action (hold)
pt_br: Ação de rolagem vertical (pressionado)

source: How the popup (when held) reacts to a vertical scroll/mouse wheel event
pt_br: Como o pop-up (quando pressionado) reage a um evento de rolagem vertical/roda do mouse

source: Horizontal scroll action
pt_br: Ação de rolagem horizontal

source: How the popup reacts to a horizontal scroll/mouse wheel event
pt_br: Como o pop-up reage a um evento de rolagem horizontal/roda do mouse

source: Horizontal scroll action (hold)
pt_br: Ação de rolagem horizontal (pressionado)

source: How the popup (when held) reacts to a horizontal scroll/mouse wheel event
pt_br: Como o pop-up (quando pressionado) reage a um evento de rolagem horizontal/roda do mouse

source: Pan
pt_br: Mover

source: Gallery
pt_br: Galeria

source: Vertical video scroll action
pt_br: Ação de rolagem vertical do vídeo

source: Overrides the vertical scroll action for videos. Set to `Default` to avoid overriding the behavior.
pt_br: Substitui a ação de rolagem vertical para vídeos. Defina como `Padrão` para evitar substituir o comportamento.

source: Invert vertical scroll seek
pt_br: Inverter busca de rolagem vertical

source: Inverts the seek direction when scrolling vertically: Scrolling up will seek right, scrolling down will seek left.
pt_br: Inverte a direção da busca ao rolar verticalmente: Rolar para cima buscará para a direita, rolar para baixo buscará para a esquerda.

source: Horizontal video scroll action
pt_br: Ação de rolagem horizontal do vídeo

source: Overrides the horizontal scroll action for videos. Set to `Default` to avoid overriding the behavior.
pt_br: Substitui a ação de rolagem horizontal para vídeos. Defina como `Padrão` para evitar substituir o comportamento.

source: Default
pt_br: Padrão

source: Seek
pt_br: Buscar

source: None
pt_br: Nenhum

source: Override scroll outside of popup
pt_br: Substituir rolagem fora do pop-up

source: Scrolling outside of the popup will also be overriden by the script
pt_br: A rolagem fora do pop-up também será substituída pelo script

source: Zoom origin
pt_br: Origem do zoom

source: The point on the image it's zoomed in/out from
pt_br: O ponto da imagem a partir do qual é ampliado/reduzido

source: Center
pt_br: Centro

source: Zoom out towards page middle
pt_br: Reduzir o zoom em direção ao meio da página

source: Sets the origin when zooming out to the page middle, overriding the "Zoom Origin" option above.
pt_br: Define a origem ao diminuir o zoom para o meio da página, substituindo a opção "Origem do Zoom" acima.

source: Within viewport
pt_br: Dentro da área de visualização

source: Zoom behavior
pt_br: Comportamento do zoom

source: How zooming should work
pt_br: Como o zoom deve funcionar

source: Fit/Full
pt_br: Ajustar/Original

source: Toggles between the full size, and fit-to-screen
pt_br: Alterna entre o tamanho original e ajustar à tela

source: Incremental zoom multiplier
pt_br: Multiplicador de zoom incremental

source: How much to zoom in/out by (for incremental zooming)
pt_br: Quanto aumentar/diminuir o zoom (para zoom incremental)

source: Move with cursor
pt_br: Mover com o cursor

source: Moves the popup as the cursor moves
pt_br: Move o pop-up conforme o movimento do cursor

source: Move within page
pt_br: Mover dentro da página

source: Ensures the popup doesn't leave the page
pt_br: Garante que o pop-up não saia da página

source: Zoom out fully to close
pt_br: Reduzir totalmente o zoom para fechar

source: Closes the popup if you zoom out past the minimum zoom
pt_br: Fecha o pop-up se você reduzir o zoom além do mínimo

source: Scroll past gallery end to close
pt_br: Rolar além do final da galeria para fechar

source: Closes the popup if you scroll past the end of the gallery
pt_br: Fecha o pop-up se você rolar além do final da galeria

source: Popup position
pt_br: Posição do pop-up

source: Where the popup will appear
pt_br: Onde o pop-up aparecerá

source: Cursor middle
pt_br: Meio do cursor

source: Underneath the mouse cursor
pt_br: Abaixo do cursor do mouse

source: Beside cursor
pt_br: Ao lado do cursor

source: Page middle
pt_br: Meio da página

source: Prevent cursor overlap
pt_br: Evitar sobreposição do cursor

source: Prevents the image from overlapping with the cursor
pt_br: Impede que a imagem se sobreponha ao cursor

source: Center popup on overflow
pt_br: Centralizar pop-up em caso de transbordamento

source: Centers the popup if its initial size overflows
pt_br: Centraliza o pop-up se seu tamanho inicial transbordar

source: Overflow origin
pt_br: Origem do transbordamento

source: Where the popup will appear in the page if its initial size overflows
pt_br: Onde o pop-up aparecerá na página se seu tamanho inicial transbordar

source: Hide cursor over popup
pt_br: Ocultar cursor sobre o pop-up

source: Hides the cursor when the mouse is over the popup
pt_br: Oculta o cursor quando o mouse está sobre o pop-up

source: Hide cursor after
pt_br: Ocultar cursor após

source: Hides the cursor over the popup after a specified period of time (in milliseconds), 0 always hides the cursor
pt_br: Oculta o cursor sobre o pop-up após um período de tempo especificado (em milissegundos), 0 sempre oculta o cursor

source: Mouse jitter threshold
pt_br: Limiar de oscilação do mouse

source: Threshold for mouse movement before the mouse cursor is shown again, 0 always shows the cursor after any movement
pt_br: Limiar para movimento do mouse antes que o cursor seja mostrado novamente, 0 sempre mostra o cursor após qualquer movimento

source: Disable pointer events
pt_br: Desabilitar eventos do ponteiro

source: Enabling this option will allow you to click on links underneath the popup
pt_br: Habilitar esta opção permitirá que você clique em links sob o pop-up

source: Ignore clicks outside popup
pt_br: Ignorar cliques fora do pop-up

source: Any mouse event outside the popup will be discarded with this option
pt_br: Qualquer evento de mouse fora do pop-up será descartado com esta opção

source: Enable downloading HLS/DASH streams
pt_br: Habilitar download de transmissões HLS/DASH

source: Downloads and muxes the contents of the streams rather than the stream information file. This currently does not work under modern browsers due to `SharedArrayBuffer` restrictions.
pt_br: Baixa e multiplexa o conteúdo dos streams em vez do arquivo de informações do stream. Atualmente, isso não funciona em navegadores modernos devido a restrições do `SharedArrayBuffer`.

source: Prefer MP4 over MKV
pt_br: Preferir MP4 em vez de MKV

source: Tries to mux the video into mp4 instead of mkv when required. This may slightly slow down muxing as it currently needs to try muxing both.
pt_br: Tenta multiplexar o vídeo em mp4 em vez de mkv quando necessário. Isso pode diminuir um pouco a multiplexação, pois atualmente precisa tentar multiplexar ambos.

source: Link image
pt_br: Vincular imagem

source: Adds a link to the image in the popup
pt_br: Adiciona um link para a imagem no pop-up

source: Link video
pt_br: Vincular vídeo

source: Adds a link to the video in the popup
pt_br: Adiciona um link para o vídeo no pop-up

source: Clicking image closes
pt_br: Fecha a imagem ao clicar
