Repository: louisje/maxurl
Catalog: po/*.po
Languages: pt_br

source: $language_native$
pt_br: Português (Brasil)

source: $description$
pt_br: Encontra versões maiores ou originais de imagens e vídeos para mais de 9400 sites

source: options_header
pt_br: opções

source: yes
pt_br: sim

source: no
pt_br: não

source: Import
pt_br: Importar

source: Export
pt_br: Exportar

source: Requires:
pt_br: Requer:

source: Or:
pt_br: Ou:

source: Redirection
pt_br: Redirecionamento

source: subcategory_update
pt_br: atualização

source: subcategory_libraries
pt_br: bibliotecas

source: subcategory_settings
pt_br: configurações

source: subcategory_ui
pt_br: interface do usuário

source: subcategory_trigger
pt_br: gatilho

source: subcategory_popup_source
pt_br: popup de origem

source: subcategory_open_behavior
pt_br: comportamento de abertura

source: subcategory_close_behavior
pt_br: comportamento de fechamento

source: subcategory_behavior
pt_br: comportamento

source: subcategory_video
pt_br: vídeo

source: subcategory_gallery
pt_br: galeria

source: subcategory_popup_other
pt_br: outros popups

source: subcategory_cache
pt_br: cache

source: Shortcuts
pt_br: Atalhos

source: subcategory_keybinds_popup_actions
pt_br: ações do pop-up de atalhos

source: Mouse cursor
pt_br: Cursor do mouse

source: Rules
pt_br: Regras

source: subcategory_rule_specific
pt_br: específico da regra

source: Website
pt_br: Site

source: Saved! Refresh the target page for changes to take effect
pt_br: Salvo! Atualize a página de destino para que as alterações tenham efeito

source: Saved!
pt_br: Salvo!

source: save
pt_br: salvar

source: Record
pt_br: Gravar

source: Cancel
pt_br: Cancelar

source: Mouseover popup (%%1) is needed to display the original version
pt_br: O popup ao passar o mouse (%%1) é necessário para exibir a versão original

source: custom headers
pt_br: cabeçalhos personalizados

source: forces download
pt_br: forçar download

source: Close
pt_br: Fechar

source: Previous
pt_br: Anterior

source: Next
pt_br: Próximo

source: Left Arrow
pt_br: Seta para Esquerda

source: Right Arrow
pt_br: Seta para Direita

source: subcategory_extension
pt_br: extensão

source: Rotate Left
pt_br: Girar para Esquerda

source: Rotate Right
pt_br: Girar para Direita

source: Buttons
pt_br: Botões

source: subcategory_replaceimages
pt_br: substituir imagens

source: subcategory_highlightimages
pt_br: realçar imagens

source: subcategory_customgallery
pt_br: galeria personalizada

source: General
pt_br: Geral

source: Enable extension
pt_br: Ativar extensão

source: Globally enables or disables the extension
pt_br: Ativa ou desativa a extensão globalmente

source: Language
pt_br: Idioma

source: Language for this extension
pt_br: Idioma para esta extensão

source: English
pt_br: Inglês

source: Español
pt_br: Espanhol

source: Français
pt_br: Francês

source: 한국어
pt_br: Coreano

source: Русский
pt_br: Russo

source: 简体中文
pt_br: Chinês simplificado

source: Dark mode
pt_br: Modo escuro

source: Changes the colors to have light text on a dark background
pt_br: Altera as cores para ter texto claro em um fundo escuro

source: Description below options
pt_br: Descrição abaixo das opções

source: Shows the description below the options (otherwise the description is only shown when you hover over the option's name)
pt_br: Mostra a descrição abaixo das opções (caso contrário, a descrição só é exibida ao passar o mouse sobre o nome da opção)

source: Show disabled options
pt_br: Exibir opções desativadas

source: If disabled, options that are disabled due to their requirements being unmet will not be displayed
pt_br: Se desativado, as opções desativadas devido a seus requisitos não serem atendidos não serão exibidas

source: Show disabled trigger profiles
pt_br: Exibir perfis de gatilho desativados

source: If disabled, options for alternate trigger profiles (options with `(#2)` after them) will not be shown if the relevant trigger isn't active
pt_br: Se desativado, as opções para perfis de gatilho alternativos (opções com `(#2)` após elas) não serão exibidas se o gatilho relevante não estiver ativo

source: Requirements below disabled options
pt_br: Requisitos abaixo das opções desativadas

source: If an option is disabled, the requirements to enable the option will be displayed below it
pt_br: Se uma opção estiver desativada, os requisitos para ativá-la serão exibidos abaixo dela

source: Check for updates
pt_br: Verificar atualizações

source: Periodically checks for updates. If a new update is available, it will be shown at the top of the options page
pt_br: Verifica periodicamente se há atualizações. Se uma nova atualização estiver disponível, ela será exibida na parte superior da página de opções

source: Update check interval
pt_br: Intervalo de verificação de atualizações

source: How often to check for updates
pt_br: Com que frequência verificar se há atualizações

source: hours
pt_br: horas

source: Notify when update is available
pt_br: Notificar quando houver atualização

source: Creates a browser notification when an update is available
pt_br: Cria uma notificação do navegador quando uma atualização está disponível

source: Show advanced settings
pt_br: Exibir configurações avançadas

source: If disabled, settings that might be harder to understand will be hidden
pt_br: Se desativado, as configurações que podem ser mais difíceis de entender serão ocultadas

source: Use tabs
pt_br: Usar abas

source: If disabled, all settings will be shown on a single page
pt_br: Se desativado, todas as configurações serão mostradas em uma única página

source: Alphabetical order
pt_br: Ordem alfabética

source: Lists options in alphabetical order
pt_br: Lista as opções em ordem alfabética

source: Allow using browser XHR
pt_br: Permitir o uso do XHR do navegador

source: This allows XHR requests to be run in the browser's context if they fail in the extension (e.g. when Tracking Protection is set to High)
pt_br: Isso permite que as solicitações XHR sejam executadas no contexto do navegador se falharem na extensão (por exemplo, quando a Proteção contra Rastreamento está definida como Alta)

source: Retry requests with 503 errors
pt_br: Repetir solicitações com erros 503

source: Amount of times to retry a request when 503 (service unavailable) is returned by the server
pt_br: Número de vezes para repetir uma solicitação quando 503 (serviço indisponível) é retornado pelo servidor

source: times
pt_br: vezes

source: Delay between 503 retries
pt_br: Atraso entre novas tentativas 503

source: Time (in milliseconds) to delay between retrying requests that received 503
pt_br: Tempo (em milissegundos) de atraso entre novas tentativas de solicitações que receberam 503

source: Use `Blob` over `ArrayBuffer`
pt_br: Usar `Blob` em vez de `ArrayBuffer`

source: Uses `Blob`s for XHRs instead of `ArrayBuffer`s. Keep this enabled unless your userscript manager doesn't support blob requests
pt_br: Usa `Blob`s para XHRs em vez de `ArrayBuffer`s. Mantenha isso ativado, a menos que seu gerenciador de userscript não suporte solicitações blob

source: Live settings reloading
pt_br: Recarregamento de configurações ao vivo

source: Enables/disables live settings reloading. There shouldn't be a reason to disable this unless you're experiencing issues with this feature
pt_br: Ativa/desativa o recarregamento de configurações ao vivo. Não deve haver motivo para desativar isso, a menos que você esteja tendo problemas com esse recurso

source: Disable keybindings when editing text
pt_br: Desativar atalhos de teclado ao editar texto

source: Disables shortcuts when key events are sent to an input area on the page
pt_br: Desativa os atalhos quando eventos de teclas são enviados para uma área de entrada na página

source: Use `GM_download` if available
pt_br: Usar `GM_download` se disponível

source: Prefers using `GM_download` over simple browser-based downloads, if the function is available. Some userscript managers download the entire file before displaying a save dialog, which can be undesirable for large video files
pt_br: Prefere usar `GM_download` em vez de downloads simples baseados em navegador, se a função estiver disponível. Alguns gerenciadores de userscript baixam o arquivo inteiro antes de exibir uma caixa de diálogo de salvamento, o que pode ser indesejável para arquivos de vídeo grandes

source: Maximum size to `GM_download`
pt_br: Tamanho máximo para `GM_download`

source: If a file is larger than this size, use a simple browser-based download instead. Set to `0` for unlimited.
pt_br: Se um arquivo for maior que este tamanho, use um download simples baseado em navegador. Defina como `0` para ilimitado.

source: Force save dialog when downloading
pt_br: Forçar caixa de diálogo de salvamento ao baixar

source: Tries to ensure the 'save as' dialog displays when downloading. This requires the 'downloads' permission to work, and will sometimes not work when custom headers are required.
pt_br: Tenta garantir que a caixa de diálogo 'salvar como' seja exibida ao baixar. Isso requer a permissão de 'downloads' para funcionar e, às vezes, não funcionará quando cabeçalhos personalizados forem necessários.

source: Enable logging to console
pt_br: Ativar registro no console

source: Allows the script to log messages to the browser console.
pt_br: Permite que o script registre mensagens no console do navegador.

source: Enable writing to clipboard
pt_br: Ativar escrita na área de transferência

source: This option does nothing on its own, but enabling it allows other functionality that require writing to the clipboard to work
pt_br: Esta opção não faz nada por si só, mas ativá-la permite que outras funcionalidades que exigem escrita na área de transferência funcionem

source: Enable redirection
pt_br: Ativar redirecionamento

source: Automatically redirect media opened in their own tab to their larger/original versions
pt_br: Redirecionar automaticamente mídias abertas em sua própria aba para suas versões maiores/originais

source: Allow video
pt_br: Permitir vídeo

source: Allows redirecting from/to video
pt_br: Permite redirecionar de/para vídeo

source: Allow audio
pt_br: Permitir áudio

source: Allows redirecting from/to audio
pt_br: Permite redirecionar de/para áudio

source: Add to history
pt_br: Adicionar ao histórico

source: Redirection will add a new entry to the browser's history
pt_br: O redirecionamento adicionará uma nova entrada ao histórico do navegador

source: Do redirection in extension
pt_br: Fazer redirecionamento na extensão

source: Performs the redirection in the extension instead of the content script. This is significantly faster and shouldn't cause issues in theory, but this option is kept in case of regressions
pt_br: Realiza o redirecionamento na extensão em vez de no script de conteúdo. Isso é significativamente mais rápido e não deve causar problemas em teoria, mas esta opção é mantida em caso de regressões

source: Use GET if HEAD is unsupported
pt_br: Usar GET se HEAD não for suportado

source: Use a GET request to check an image's availability, if the server does not support HEAD requests
pt_br: Usar uma solicitação GET para verificar a disponibilidade de uma imagem, se o servidor não suportar solicitações HEAD

source: Try finding extra information
pt_br: Tentar encontrar informações extras

source: Enables methods that use API calls for finding extra information, such as the original page, caption, or album information. Note that this option does not affect finding the original media.
pt_br: Ativa métodos que usam chamadas de API para encontrar informações extras, como a página original, legenda ou informações do álbum. Observe que esta opção não afeta a localização da mídia original.

source: Enable tooltip
pt_br: Ativar dica de ferramenta

source: Enables the 'Mouseover popup is needed to display the original version' tooltip
pt_br: Ativa a dica de ferramenta 'É necessário passar o mouse sobre o popup para exibir a versão original'

source: Show image URL in tooltip
pt_br: Mostrar URL da imagem na dica de ferramenta

source: If the popup is needed to display the larger version of an image, display the image link in the tooltip
pt_br: Se o popup for necessário para exibir a versão maior de uma imagem, exiba o link da imagem na dica de ferramenta

source: Hide tooltip after
pt_br: Ocultar dica de ferramenta após

source: Hides the tooltip after the specified number of seconds (or when the mouse clicks on it). Set to 0 to never hide automatically
pt_br: Oculta a dica de ferramenta após o número especificado de segundos (ou quando o mouse clica nela). Defina como 0 para nunca ocultar automaticamente

source: Log info object to console
pt_br: Registrar objeto de informações no console

source: Prints the full info object to the console whenever a popup/redirect is found
pt_br: Imprime o objeto de informações completo no console sempre que um popup/redirecionamento for encontrado

source: Disable when response headers need modifying
pt_br: Desativar quando os cabeçalhos de resposta precisarem ser modificados

source: This option works around Chrome's migration to manifest v3, redirecting some images to being force-downloaded
pt_br: Esta opção contorna a migração do Chrome para o manifesto v3, redirecionando algumas imagens para serem baixadas à força

source: Redirect to largest without issues
pt_br: Redirecionar para a maior sem problemas

source: Redirects to the largest image found that doesn't require custom headers or forces download
pt_br: Redireciona para a maior imagem encontrada que não requer cabeçalhos personalizados ou força o download

source: Redirect for HTML pages too
pt_br: Redirecionar páginas HTML também

source: Tries redirection even if the host page is HTML. This option might be useful for dead links. However, this will also result in many normal pages being redirected to images/video, so use with caution.
pt_br: Tenta redirecionar mesmo se a página de origem for HTML. Esta opção pode ser útil para links inativos. No entanto, isso também fará com que muitas páginas normais sejam redirecionadas para imagens/vídeo, portanto, use com cautela.

source: This will result in many pages being redirected to images/videos. I'd recommend only either enabling this for the media you need it for then disabling it after, or using the black/whitelist feature below to only allow it to run for specified websites.
pt_br: Isso resultará no redirecionamento de várias páginas para imagens/vídeos. Recomendo habilitar esta opção apenas para a mídia que você precisa e desabilitá-la em seguida, ou usar o recurso de lista negra/branca abaixo para permitir que ela seja executada apenas em sites específicos.

source: Enable mouseover popup
pt_br: Ativar pop-up ao passar o mouse

source: Show a popup with the larger image when you mouseover an image with the trigger key held (if applicable)
pt_br: Exibir um pop-up com a imagem ampliada ao passar o mouse sobre uma imagem com a tecla de gatilho pressionada (se aplicável)

source: Mouseover popup trigger
pt_br: Gatilho do pop-up ao passar o mouse

source: How the popup will get triggered
pt_br: Como o pop-up será acionado

source: Mouseover
pt_br: Ao passar o mouse

source: Triggers when your mouse is over the image
pt_br: Aciona quando o mouse está sobre a imagem

source: Key trigger
pt_br: Tecla de gatilho

source: Triggers when you press a key sequence when your mouse is over an image
pt_br: Aciona ao pressionar uma sequência de teclas quando o mouse está sobre uma imagem

source: Disables the popup from being triggered (useful if you only want to use the context menu item)
pt_br: Desativa o acionamento do pop-up (útil se você deseja usar apenas o item do menu de contexto)

source: Popup trigger key
pt_br: Tecla de gatilho do pop-up

source: Key sequence to trigger the popup
pt_br: Sequência de teclas para acionar o pop-up

source: Popup trigger key (#2)
pt_br: Tecla de gatilho do pop-up (#2)

source: Key sequence to trigger the popup with alternate options. Search for `(#2)` to find the relevant options
pt_br: Sequência de teclas para acionar o pop-up com opções alternativas. Procure por `(#2)` para encontrar as opções relevantes

source: Popup trigger key (#3)
pt_br: Tecla de gatilho do pop-up (#3)

source: Key sequence to trigger the popup with alternate options. Search for `(#3)` to find the relevant options
pt_br: Sequência de teclas para acionar o pop-up com opções alternativas. Procure por `(#3)` para encontrar as opções relevantes

source: Popup trigger delay
pt_br: Atraso no acionamento do pop-up

source: Delay (in seconds) before the popup shows
pt_br: Atraso (em segundos) antes da exibição do pop-up

source: Use mouseover event
pt_br: Usar evento mouseover

source: Uses the mouseover event instead of mousemove to figure out where to trigger the popup. This more closely matches the way other image popup addons work, at the cost of configurability
pt_br: Usa o evento 'mouseover' em vez de 'mousemove' para determinar onde acionar o pop-up. Isso se assemelha mais ao funcionamento de outros complementos de pop-up de imagem, em detrimento da configurabilidade

source: Enable/disable toggle
pt_br: Alternância de ativar/desativar

source: Controls whether the 'Popup enable/disable key' will enable or disable the popup from opening
pt_br: Controla se a 'Tecla de ativar/desativar pop-up' irá ativar ou desativar a abertura do pop-up

source: Enable
pt_br: Ativar

source: Disable
pt_br: Desativar

source: Popup enable/disable key
pt_br: Tecla de ativar/desativar pop-up

source: Holding down this key will enable or disable the popup from being opened, depending on the 'Enable/disable toggle' setting
pt_br: Manter esta tecla pressionada ativará ou desativará a abertura do pop-up, dependendo da configuração 'Alternância de ativar/desativar'

source: Allow showing partially loaded
pt_br: Permitir exibição de carregamento parcial

source: This will allow the popup to open for partially loaded media. Partially loaded media will contain the source URL directly (where possible), whereas fully loaded media will use a blob or data URL.
pt_br: Isso permitirá que o popup seja aberto para mídia parcialmente carregada. Mídia parcialmente carregada conterá a URL de origem diretamente (quando possível), enquanto mídia totalmente carregada usará um blob ou data URL.

source: This will allow the popup to open for partially loaded media, but this might break images that require custom headers to display properly. Partially loaded media will contain the source URL directly (where possible), whereas fully loaded media will use a blob or data URL.
pt_br: Isso permitirá que o popup seja aberto para mídia parcialmente carregada, mas pode quebrar imagens que exigem cabeçalhos personalizados para serem exibidas corretamente. Mídia parcialmente carregada conterá a URL de origem diretamente (quando possível), enquanto mídia totalmente carregada usará um blob ou data URL.

source: Streams
pt_br: Transmissões

source: Audio and video
pt_br: Áudio e vídeo

source: Media
pt_br: Mídia

source: Images, audio, and video
pt_br: Imagens, áudio e vídeo

source: Avoid HEAD request for partially loaded media
pt_br: Evitar requisição HEAD para mídia parcialmente carregada

source: Avoids a possibly unnecessary HEAD request before displaying partially loaded images, which further decreases the delay before opening the popup. This can cause issues if the server returns an error, but still returns an image
pt_br: Evita uma requisição HEAD possivelmente desnecessária antes de exibir imagens parcialmente carregadas, o que diminui ainda mais o atraso antes de abrir o pop-up. Isso pode causar problemas se o servidor retornar um erro, mas ainda assim retornar uma imagem

source: Use `blob:` over `data:` URLs
pt_br: Use `blob:` em vez de URLs `data:`

source: Blob URLs are more efficient, but aren't supported by earlier browsers. Some websites also block `blob:` URLs
pt_br: URLs Blob são mais eficientes, mas não são suportadas por navegadores mais antigos. Alguns sites também bloqueiam URLs `blob:`

source: Load media anonymously
pt_br: Carregar mídia anonimamente

source: Loads the media without sending any cookies or other forms of credentials. This is required to screenshot videos from other sources
pt_br: Carrega a mídia sem enviar cookies ou outras formas de credenciais. Isso é necessário para capturar vídeos de outras fontes

source: Use `not-allowed` cursor when unsupported
pt_br: Usar cursor `not-allowed` quando não for suportado

source: If the image isn't supported, the mouse cursor will change to a `not-allowed` cursor for a brief duration
pt_br: Se a imagem não for suportada, o cursor do mouse mudará para um cursor `not-allowed` por um breve período

source: Use `not-allowed` cursor when unable to load
pt_br: Usar cursor `not-allowed` quando não for possível carregar

source: If the image fails to load, the mouse cursor will change to a `not-allowed` cursor for a brief duration
pt_br: Se a imagem não carregar, o cursor do mouse mudará para um cursor `not-allowed` por um breve período

source: `not-allowed` cursor duration
pt_br: Duração do cursor `not-allowed`

source: How long the `not-allowed` cursor should last
pt_br: Tempo de duração do cursor `not-allowed`

source: Exclude image tabs
pt_br: Excluir abas de imagens

source: Excludes images that are opened in their own tabs
pt_br: Exclui imagens que são abertas em suas próprias abas

source: Exclude if media URL is unchanged
pt_br: Excluir se a URL da mídia não for alterada

source: Don't pop up if the new URL is the same as the source
pt_br: Não exibir pop-up se a nova URL for igual à fonte

source: Only popup for linked media
pt_br: Pop-up apenas para mídia com link

source: Don't pop up if the media isn't hyperlinked
pt_br: Não exibir pop-up se a mídia não tiver um hiperlink

source: Popup link for linked media
pt_br: Link em pop-up para mídia com link

source: If the linked media cannot be made larger, pop up for the link instead of the media
pt_br: Se a mídia com link não puder ser ampliada, exibir o link em um pop-up em vez da mídia

source: Exclude image maps
pt_br: Excluir mapas de imagem

source: Don't pop up if the image is an image map (image with multiple clickable areas)
pt_br: Não exibir pop-up se a imagem for um mapa de imagem (imagem com várias áreas clicáveis)

source: Autoplay
pt_br: Reprodução automática

source: Play automatically once the popup is opened
pt_br: Reproduzir automaticamente quando o pop-up for aberto

source: Show video controls
pt_br: Exibir controles de vídeo

source: Shows native video controls. Note that this prevents dragging under Firefox
pt_br: Exibe os controles nativos de vídeo. Observe que isso impede o arrastar no Firefox

source: Toggle video controls
pt_br: Alternar controles de vídeo

source: Key to toggle whether the video controls are shown
pt_br: Tecla para alternar a exibição dos controles de vídeo

source: Loop
pt_br: Repetir

source: Allows the media to automatically restart to the beginning after finishing playing
pt_br: Permite que a mídia seja reiniciada automaticamente após o término da reprodução

source: Max duration for looping
pt_br: Duração máxima para repetição

source: Media longer than the specified duration will not be automatically looped. Setting this to `0` will always enable looping, regardless of duration.
pt_br: Mídias com duração maior que a especificada não serão repetidas automaticamente. Definir como `0` sempre habilitará a repetição, independentemente da duração.

source: Play/pause key
pt_br: Tecla de reproduzir/pausar

source: Key to toggle whether the media is playing or paused
pt_br: Tecla para alternar entre reproduzir e pausar a mídia

source: Mute
pt_br: Silenciar

source: Mutes the media by default
pt_br: Silenciar a mídia por padrão

source: Toggle mute key
pt_br: Tecla de alternar para mudo
