Repository: louisje/maxurl
Catalog: po/*.po
Languages: pt_br

source: Enables rules that return possibly undesirable uncropped images
pt_br: Habilita regras que retornam imagens não cortadas possivelmente indesejáveis

source: Mobile wallpaper websites (returns the full version of the wallpaper image)
pt_br: Sites de papéis de parede para celular (retorna a versão completa da imagem do papel de parede)

source: Rules using 3rd-party websites
pt_br: Regras que utilizam sites de terceiros

source: Enables rules that use 3rd-party websites
pt_br: Habilita regras que utilizam sites de terceiros

source: Rules using API calls
pt_br: Regras que utilizam chamadas de API

source: Enables rules that use API calls. Strongly recommended to keep this enabled
pt_br: Habilita regras que utilizam chamadas de API. É altamente recomendável manter esta opção ativada

source: Allow 3rd-party libraries
pt_br: Permitir bibliotecas de terceiros

source: Enables using 3rd-party libraries. This is both used in rules and as a prerequisite for certain functionality.
pt_br: Habilita o uso de bibliotecas de terceiros. Isso é usado tanto em regras quanto como um pré-requisito para certas funcionalidades.

source: Enables using 3rd-party libraries. This is both used in rules and as a prerequisite for certain functionality. There is a possible (but unlikely) security risk for the userscript version.
pt_br: Habilita o uso de bibliotecas de terceiros. Isso é usado tanto em regras quanto como pré-requisito para certas funcionalidades. Há um risco de segurança possível (mas improvável) para a versão userscript.

source: Sites using testcookie (slowAES)
pt_br: Sites que usam testcookie (slowAES)

source: Rules executing 3rd-party code
pt_br: Regras que executam código de terceiros

source: Enables rules that execute arbitrary 3rd-party code stored on websites.
pt_br: Habilita regras que executam código arbitrário de terceiros armazenado em sites.

source: This could lead to security risks, please be careful when using this option!
pt_br: Isso pode levar a riscos de segurança, por favor, tenha cuidado ao usar esta opção!

source: Rules using brute-force
pt_br: Regras que usam força bruta

source: Enables rules that require using brute force (through binary search) to find the original image
pt_br: Habilita regras que exigem o uso de força bruta (através de busca binária) para encontrar a imagem original

source: Web Archive support
pt_br: Suporte ao Web Archive

source: Allows rules to be run under archive.org's Wayback Machine.
pt_br: Permite que as regras sejam executadas na Wayback Machine do archive.org.

source: Use browser cookies
pt_br: Usar cookies do navegador

source: Uses the browser's cookies for API calls in order to access otherwise private data
pt_br: Utiliza os cookies do navegador para chamadas de API a fim de acessar dados que, de outra forma, seriam privados

source: Private Flickr images
pt_br: Imagens privadas do Flickr

source: DeviantART: Prefer size over original
pt_br: DeviantART: Preferir tamanho em vez de original

source: Prefers a larger (but not upscaled) thumbnail image over a smaller original animated image
pt_br: Prefere uma imagem em miniatura maior (mas não ampliada) em vez de uma imagem animada original menor

source: DeviantART: Use download links
pt_br: DeviantART: Usar links de download

source: Prefers using the download link (if available) by default. Note that this only works if you're logged in to DeviantART
pt_br: Prefere usar o link de download (se disponível) por padrão. Observe que isso só funciona se você estiver conectado ao DeviantART

source: E-Hentai: Use full image
pt_br: E-Hentai: Usar imagem completa

source: Prefers using full/original images if available (logged in). This is more likely to get you rate limited
pt_br: Prefere usar imagens completas/originais, se disponíveis (conectado). Isso tem mais chances de te deixar com limite de taxa

source: Imgur: Use original filename
pt_br: Imgur: Usar nome de arquivo original

source: If the original filename (the one used to upload the image) is found, use it instead of the image ID
pt_br: Se o nome de arquivo original (aquele usado para enviar a imagem) for encontrado, use-o em vez do ID da imagem

source: Imgur: Use source image
pt_br: Imgur: Usar imagem de origem

source: If a source image is found for Imgur, try using it instead. Only works for old-style Imgur webpages (set `postpagebeta=0; postpagebetalogged=0` as cookies)
pt_br: Se uma imagem de origem for encontrada para o Imgur, tente usá-la. Funciona apenas para páginas antigas do Imgur (defina `postpagebeta=0; postpagebetalogged=0` como cookies)

source: Instagram: Use native API
pt_br: Instagram: Usar API nativa

source: Uses Instagram's native API if possible, requires you to be logged into Instagram. This usually allows for higher resolution images (1440x*) to be returned.
pt_br: Usa a API nativa do Instagram se possível, requer que você esteja logado no Instagram. Geralmente permite que imagens de resolução mais alta (1440x*) sejam retornadas.

source: Instagram: Don't use web API
pt_br: Instagram: Não usar API web

source: Avoids using Instagram's web API if possible, which increases performance, but will occasionally sacrifice quality for videos
pt_br: Evita usar a API web do Instagram, se possível, o que aumenta o desempenho, mas ocasionalmente sacrifica a qualidade dos vídeos

source: Instagram: Prefer quality over resolution
pt_br: Instagram: Preferir qualidade à resolução

source: Prefers lower resolution videos that use a higher bitrate over higher resolution images. This adds a slight performance cost as it needs to fetch headers for multiple videos
pt_br: Prefere vídeos de resolução mais baixa que usam uma taxa de bits mais alta em vez de imagens de resolução mais alta. Isso adiciona um pequeno custo de desempenho, pois precisa buscar cabeçalhos para vários vídeos

source: Instagram: Use albums for post thumbnails
pt_br: Instagram: Usar álbuns para miniaturas de posts

source: Queries Instagram for albums when using the popup on a post thumbnail
pt_br: Consulta o Instagram por álbuns ao usar o popup em uma miniatura de post

source: Snapchat: Use original media without captions
pt_br: Snapchat: Usar mídia original sem legendas

source: Prefers using original media instead of media with captions and tags overlayed
pt_br: Prefere usar a mídia original em vez de mídia com legendas e tags sobrepostas

source: Teddit: Use Reddit for media
pt_br: Teddit: Usar Reddit para mídia

source: Redirects media stored on Teddit to Reddit's servers. Disabling this may prevent finding original images because Teddit's image servers will only cache images fetched from posts, which are deleted after a few minutes.
pt_br: Redireciona mídias armazenadas no Teddit para os servidores do Reddit. Desativar isso pode impedir a localização de imagens originais porque os servidores de imagem do Teddit armazenarão em cache apenas imagens obtidas de posts, que são excluídas após alguns minutos.

source: TikTok: Use app API
pt_br: TikTok: Usar API do aplicativo

source: Uses TikTok's app API to find video information.
pt_br: Usa a API do aplicativo TikTok para encontrar informações de vídeo.

source: TikTok: Don't use watermarked videos
pt_br: TikTok: Não usar vídeos com marca d'água

source: Uses non-watermarked videos for TikTok if possible. This will introduce an extra delay when loading the video as two extra requests need to be performed. It will also fail for any videos uploaded after ~late July 2020
pt_br: Usa vídeos sem marca d'água para o TikTok, se possível. Isso introduzirá um atraso extra ao carregar o vídeo, pois duas solicitações extras precisam ser realizadas. Também falhará para qualquer vídeo enviado após o final de julho de 2020

source: TikTok: 3rd-party watermark removal
pt_br: TikTok: Remoção de marca d'água por terceiros

source: Uses a 3rd-party watermark removal site for TikTok. I do not endorse any of the sites supported. They may log your IP address and videos you submit. Use this option with caution. `LQ` = Low quality, `PL` = Public log
pt_br: Usa um site de terceiros para remoção de marca d'água do TikTok. Não endosso nenhum dos sites suportados. Eles podem registrar seu endereço IP e os vídeos que você enviar. Use esta opção com cautela. `LQ` = Baixa qualidade, `PL` = Registro público

source: (none)
pt_br: (nenhum)

source: keeptiktok.com (LQ)
pt_br: keeptiktok.com (BQ)

source: ssstiktok.io (LQ)
pt_br: ssstiktok.io (BQ)

source: musicallydown.com (LQ/PL)
pt_br: musicallydown.com (BQ/PL)

source: snaptik.app (LQ)
pt_br: snaptik.app (BQ)

source: tikmate.online (LQ)
pt_br: tikmate.online (BQ)

source: Tumblr: API key
pt_br: Tumblr: Chave da API

source: API key for finding larger images on Tumblr
pt_br: Chave da API para encontrar imagens maiores no Tumblr

source: Twitter: Use extension
pt_br: Twitter: Usar extensão

source: Prefers `.jpg?name=orig` over `?format=jpg&name=orig`. This will possibly incur extra requests before succeeding. Note that there is no difference in image quality.
pt_br: Prefere `.jpg?name=orig` em vez de `?format=jpg&name=orig`. Isso possivelmente incorrerá em requisições extras antes de obter sucesso. Note que não há diferença na qualidade da imagem.

source: YouTube: Enable faster speeds
pt_br: YouTube: Habilitar velocidades mais rápidas

source: Increases the download bandwidth for YouTube videos by replacing the `n` parameter. Note that this may execute untrusted Javascript.
pt_br: Aumenta a largura de banda de download para vídeos do YouTube, substituindo o parâmetro `n`. Observe que isso pode executar Javascript não confiável.

source: Media blacklist
pt_br: Lista negra de mídia

source: A list of URLs (one per line) that are blacklisted from being processed
pt_br: Uma lista de URLs (uma por linha) que estão na lista negra e não serão processadas

source: Media blacklist mode
pt_br: Modo de lista negra de mídia

source: Whether the media blacklist should act as a blacklist or a whitelist
pt_br: Se a lista negra de mídia deve funcionar como uma lista negra ou uma lista branca

source: Blacklist engine
pt_br: Mecanismo de lista negra

source: How blacklists should be processed
pt_br: Como as listas negras devem ser processadas

source: Simple (glob)
pt_br: Simples (glob)

source: Host blacklist
pt_br: Lista negra de hosts

source: A list of host URLs (one per line) that the popup is blacklisted from. For example, adding `twitter.com` to this blacklist would prevent any popup from opening on twitter.com.
pt_br: Uma lista de URLs de hosts (uma por linha) para as quais o popup está na lista negra. Por exemplo, adicionar `twitter.com` a esta lista negra impediria que qualquer popup fosse aberto em twitter.com.

source: Host blacklist mode
pt_br: Modo de lista negra de hosts

source: Whether the host blacklist should act as a blacklist or a whitelist
pt_br: Se a lista negra de hosts deve funcionar como uma lista negra ou uma lista branca

source: HTML page blacklist
pt_br: Lista negra de páginas HTML

source: A list of URLs (one per line) that are blacklisted from being redirected.
pt_br: Uma lista de URLs (uma por linha) que estão na lista negra e não serão redirecionadas.

source: The examples below are written for the simple (glob) engine, not the regex engine. The glob engine is generally based on the UNIX glob syntax.<br /> <ul><br /> <li><code>google.com</code> will block https://google.com/, https://www.google.com/, https://abcdef.google.com/, https://def.abc.google.com/, etc.</li> <li><code>abc.google.com</code> will block https://abc.google.com/, https://def.abc.google.com/, etc.</li> <li><code>*.google.com</code> will block https://www.google.com/, https://def.abc.google.com/, etc. but not https://google.com/</li> <li><code>google.*/</code> will block https://google.com/, https://www.google.co.uk, etc.</li> <li><code>http://google.com</code> will block http://google.com/, but not https://google.com/, http://www.google.com/, etc.</li> <li><code>google.com/test</code> will block https://google.com/test, https://www.google.com/test/abcdef, but not https://google.com/, etc.</li> <li><code>google.com/*/test</code> will block https://google.com/abc/test, but not https://google.com/test or https://google.com/abc/def/test</li> <li><code>google.com/**/test</code> will block https://google.com/abc/test, https://google.com/abc/def/test, https://google.com/abc/def/ghi/test, etc. but not https://google.com/test</li> <li><code>g??gle.com</code> will block https://google.com/, https://gaagle.com/, https://goagle.com/, etc.</li> <li><code>google.{com,co.uk}</code> will block https://google.com/ and https://google.co.uk/</li> <li><code>g[oau]ogle.com</code> will block https://google.com/, https://gaogle.com/, and http://www.guogle.com/</li> <li><code>g[0-9]ogle.com</code> will block https://g0ogle.com/, https://g1ogle.com/, etc. (up to https://g9ogle.com/)</li> </ul>
pt_br: Os exemplos abaixo foram escritos para o mecanismo simples (glob), não o mecanismo regex. O mecanismo glob é geralmente baseado na sintaxe glob do UNIX.<br /> <ul><br /> <li><code>google.com</code> bloqueará https://google.com/, https://www.google.com/, https://abcdef.google.com/, https://def.abc.google.com/, etc.</li> <li><code>abc.google.com</code> bloqueará https://abc.google.com/, https://def.abc.google.com/, etc.</li> <li><code>*.google.com</code> bloqueará https://www.google.com/, https://def.abc.google.com/, etc. mas não https://google.com/</li> <li><code>google.*/</code> bloqueará https://google.com/, https://www.google.co.uk, etc.</li> <li><code>http://google.com</code> bloqueará http://google.com/, mas não https://google.com/, http://www.google.com/, etc.</li> <li><code>google.com/test</code> bloqueará https://google.com/test, https://www.google.com/test/abcdef, mas não https://google.com/, etc.</li> <li><code>google.com/*/test</code> bloqueará https://google.com/abc/test, mas não https://google.com/test ou https://google.com/abc/def/test</li> <li><code>google.com/**/test</code> bloqueará https://google.com/abc/test, https://google.com/abc/def/test, https://google.com/abc/def/ghi/test, etc. mas não https://google.com/test</li> <li><code>g??gle.com</code> bloqueará https://google.com/, https://gaagle.com/, https://goagle.com/, etc.</li> <li><code>google.{com,co.uk}</code> bloqueará https://google.com/ e https://google.co.uk/</li> <li><code>g[oau]ogle.com</code> bloqueará https://google.com/, https://gaogle.com/, e http://www.guogle.com/</li> <li><code>g[0-9]ogle.com</code> bloqueará https://g0ogle.com/, https://g1ogle.com/, etc. (até https://g9ogle.com/)</li> </ul>

source: HTML page blacklist mode
pt_br: Modo de lista negra de páginas HTML

source: Whether the HTML page blacklist should act as a blacklist or a whitelist
pt_br: Se a lista negra de páginas HTML deve funcionar como uma lista negra ou uma lista branca

source: Whitelist
pt_br: Lista branca

source: Blacklist
pt_br: Lista negra

source: Filename format
pt_br: Formato do nome do arquivo

source: Format string(s) for the filename
pt_br: String(s) de formatação para o nome do arquivo

source: Documentation
pt_br: Documentação
